[{"title": "Senior Software Engineer React", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "javascript", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-senior-software-engineer-react", "employment_types": [{"type": "permanent", "salary": {"from": 18000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "HTML", "level": 4}, {"name": "JavaScript", "level": 4}, {"name": "React", "level": 5}], "remote": false, "multilocation": [{"city": "Tarnów", "slug": "splunk-senior-software-engineer-react-tarnow", "street": "Centrum"}, {"city": "Katowice", "slug": "splunk-senior-software-engineer-react-katowice", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-senior-software-engineer-react", "street": "Długa"}], "description": "Join us as we pursue our innovative vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, our customers, having fun and most meaningfully, to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\n\n\n\nAre you passionate about working on critical systems to create tangible customer impact? Would you like the opportunity to work at a growing company that is changing the way that information is used to support business decisions? If this resonates with you, we would love to speak with you.\n\n\n\nOur team is a dynamic technology group with a mission to make data accessible, usable and valuable to everyone. If you possess a passion for outstanding technology leadership and embrace the challenge of working on highly scalable systems that handle large volumes of data, this position is for you. We are building state-of-the art capabilities, data processing and search systems, support tools, security frameworks and automation instrumentation that will greatly impact how our customers successfully use data to improve their businesses performance, scalability, profitability, and market strategies.\n\n\n\nRole\n\nParticipate in the complete software development cycle: Understand requirements, design, develop, test, automate and deploy software\nIdentify and resolve pre-production system bottlenecks and production issues\nEngage in design and code reviews of the product, and enhance your knowledge of customers’ experiences to prevent future problems\nMake code maintainable and the product diagnosable and serviceable\nParticipate in rotating on-call duties to diagnose and solve customer issues.\nOwn features from start to finish; Mentor junior engineers\n\n\nRequirements\n\nStrong fundamentals in software engineering: data structures and algorithms\nYou have very good JavaScript, CSS and HTML authoring skills.\nYou have created rich visualizations and UI/UX using ReactJS and Redux.\nExperience with UI testing frameworks like Mocha, Chai, Jasmine, Jest, WebdriverIO\nExperience in working on distributed systems like databases, distributed file systems, distributed concurrency control, consistency models, CAP theorem is an added plus.\nStrong debugging and troubleshooting skills including the use of associated tools\nExperience with developing CI/CD systems, test automation frameworks, \nAbility to document your work for the benefit of the team\nKnowledge of REST, grpc or similar communication paradigms\nKnowledge of public cloud services such as AWS, GCP, Azure \nOperational excellence: you think beyond feature delivery into how your code is serving customers in production\n\n\nWhat we offer\n\nA team of incredibly capable and dedicated peers, all the way from engineering to product management and customer support.\nA stable, collaborative, and supportive work environment. We work in an open environment, work together to get things done, and adapt to the changing needs for the team. We keep it real by being open and honest. \nBalance. We want you to be successful outside of work too. We trust our colleagues to be responsible with their time and commitment, and believe that balance helps cultivate a positive environment.\nFun. We are committed to having every employee want to give it their all, be respectful and a part of the family, and have a smile on their face while doing it.\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\n\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Analityk/Analityczka Danych", "street": "Domaniewska 49", "country_code": "PL", "address_text": "Domaniewska 49, Warszawa", "marker_icon": "data", "workplace_type": "partly_remote", "company_name": "Ringier Axel Springer Polska", "company_url": "https://www.ringieraxelspringer.pl/", "company_size": "501+", "experience_level": "mid", "id": "ringier-axel-springer-polska-analityk-analityczka-danych", "employment_types": [{"type": "permanent", "salary": null}, {"type": "b2b", "salary": null}], "skills": [{"name": "Python", "level": 2}, {"name": "Google Analytics", "level": 3}, {"name": "SQL", "level": 3}], "remote": false, "multilocation": [{"city": "Poznań", "slug": "ringier-axel-springer-polska-analityk-analityczka-danych-poznan", "street": "Centrum"}, {"city": "Gdańsk", "slug": "ringier-axel-springer-polska-analityk-analityczka-danych-gdansk", "street": "Centrum"}, {"city": "Kraków", "slug": "ringier-axel-springer-polska-analityk-analityczka-danych-krakow", "street": "Centrum"}, {"city": "Warszawa", "slug": "ringier-axel-springer-polska-analityk-analityczka-danych", "street": "Domaniewska 49"}], "description": "Jesteśmy największą w Polsce firmą mediowo-technologiczną. Dostarczamy wiarygodnych informacji i tworzymy usługi cyfrowe, którym można zaufać. Stawiamy na utalentowanych ludzi, zrównoważony rozwój oraz mądre użycie technologii. ortfolio mediów Ringier Axel Springer Polska obejmuje ponad 20 uznanych marek drukowanych i cyfrowych takich jak: Onet - największy portal informacyjny w Polsce, Fakt - największy polski dziennik oraz Sympatia - lider w internetowych serwisach randkowych w Polsce.\n\nCo będzie należało do Twoich obowiązków:\n\n👉Codzienne wsparcie w analizach ruchu i zachowań użytkowników\n👉Wyszukiwanie insightów i tworzenie rekomendacji dla biznesu\n👉Analityka efektywności wykorzystania naszych powierzchni reklamowych i działań marketingowych\n👉Analiza ścieżek użytkownika w kanałach digital\n👉Współpraca przy tworzeniu testów A/B oraz analiza ich wyników\n👉Wsparcie zespołów developerskich w implementacji niestandardowych pomiarów\n👉Udział w projektach specjalnych poprawiających działania i procesy biznesowe na poziomie całej grupy\n\nCzego oczekujemy?\n\n👍Znajomość SQL i praktyczne doświadczenie z bazami danych\n👍Min. 1 rok doświadczenia w obszarze analityki internetowej\n👍Doświadczenie w wykorzystaniu w analityce Python’a lub R’a\n👍Znajomość narzędzi do wizualizacji danych (np. Tableau, DataStudio)\n👍Wysokie umiejętności interpretacji danych i przygotowywania rekomendacji biznesowych w oparciu o dane\n👍Mile widziana znajomość AWS, Google Analytics\n\nOferujemy:\n\n✔️ Smart work – elastyczny model pracy\n✔️ Kafeteria benefitowa NAIS\n✔️ Karta multisport i wyzwania sportowe\n✔️Ubezpieczenie na życie dla ciebie i rodziny\n✔️Prywatna opieka medyczna\n✔️Legendarne imprezy\n✔️Wsparcie psychologiczne i program well-being\n✔️Platformy e-learningowe i szeroka oferta szkoleń\n✔️ Kultura doceniania – People Awards i codzienne kudosy Praca z misją dla najbardziej rozpoznawalnych marek w Polsce\n✔️ Nowoczesne biura — kolorowe, wygodne i ekologiczne\nInformujemy, że administratorem danych jest Ringier Axel Springer Polska sp.z o. o.z siedzibą w Warszawie, ul. Domaniewska (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych ora... more"}, {"title": "Principal Software Engineer", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "java", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-principal-software-engineer-krakow", "employment_types": [{"type": "permanent", "salary": {"from": 27000, "to": 33000, "currency": "pln"}}], "skills": [{"name": "Scala", "level": 5}, {"name": "Java", "level": 5}], "remote": false, "multilocation": [{"city": "Tarnów", "slug": "splunk-principal-software-engineer-72220c55-fb2d-4887-901d-0611e73ec25e", "street": "Centrum"}, {"city": "Katowice", "slug": "splunk-principal-software-engineer-49e589b7-c9b7-405e-82af-6bd3ea88101a", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-principal-software-engineer-krakow", "street": "Długa"}], "description": "Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\n\n\nAre you passionate about working on products that make a difference for your customers? Do you enjoy building large scale applications that are powered by huge data sets? Do you value working in an environment where you're empowered to make key technical decisions across a full stack of technologies? If so, a role on Splunk’s Security Analytics team would be a great fit for you.\n\n\nRole\n\n\nWe are seeking a Principal Software Engineer to help lead, design, develop and deliver Splunk's User Behavior Analytics (UBA) security analytics solution that detects known and unknown security threats at scale using big data and machine learning techniques. Delivered on customer managed resources using Kubernetes and Spark to run innovative stream processing and machine learning algorithms in near real-time, UBA helps security analysts quickly identify and resolve threats.\n\n\nWe are a passionate team who care deeply about our customers and our teammates. In this role, you will work directly with Product Management, our Design Team, our Customers and other engineering teams to help derive the best experience for the customer. We have a lean process that focuses on empowering and serving our engineers as opposed to just directing them.\n\n\nResponsibilities\n\nAchieve a deep knowledge of our product architecture, usage patterns, and real world use-cases in order to better understand what solutions will bring value to our customers\nDevelop new product features, clarify and improve designs, and help put together a plan for how to make it happen (using Agile Methodologies)\nCollaborate closely with Product Management and members of our team to design and create comprehensive end-to-end user workflows\nKeep product quality top of mind by extensively using Continuous Integration/Continuous Development (CI/CD), testing technologies (unit, functional, performance), and best practices to ensure that the product is of high quality\nChampion, coach and mentor others to solve problems in new and creative ways with the goal to maintain team efficiency and morale\n\nExperience\n\n\nRequired:\n\nJava and/or Scala programming experience\nFamiliarity with streaming and distributed computing technologies such as Kafka, Spark, Hadoop, Impala, Postgres\nExposure to working with container ecosystems (Docker, Kubernetes, Kubernetes Operator Framework)\nKnowledge of distributed computing architectures and principles that solve for scalability, performance, redundancy and reliability\nExperienced with an Agile DevOps engineering environment that effectively uses CI/CD pipelines such as GitLab\nStrong collaborative and interpersonal skills, specifically a proven ability to effectively work with others within a dynamic environment\nAbility to learn new technologies quickly and to understand a wide variety of technical challenges to be solved\n12 years of related experience with a technical Bachelor’s degree; or equivalent practical experience; or 10 years and a technical Master’s degree; or a Ph.D. with 9 years experience; or equivalent practical experience\n\nDesired:\n\nBackground in developing machine learning products for the Security market \nExperience in building an ETL pipeline with high-volume data ingestion\nExamples of leadership and architecture design of big data and ML based platforms\nFamiliarity with Splunk’s Security products \n\n\nWhat We Offer You\n\nA constant stream of new things for you to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies\nA set of exceptionally talented and dedicated peers, all the way from engineering to product management and customer support\nGrowth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation\nA stable, collaborative and supportive work environment\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Cloud SecOps Engineer", "street": "Przyokopowa 26a", "country_code": "PL", "address_text": "Przyokopowa 26a, Warszawa", "marker_icon": "devops", "workplace_type": "partly_remote", "company_name": "SIX", "company_url": "https://www.six-group.com/en/home.html", "company_size": "200+", "experience_level": "junior", "id": "six-cloud-secops-engineer-08662e13-698f-4383-a09f-7fcdc12914e7", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "Azure", "level": 2}, {"name": "SaaS", "level": 2}], "remote": false, "multilocation": [{"city": "Madryt", "slug": "six-cloud-secops-engineer-madryt", "street": "-"}, {"city": "Warszawa", "slug": "six-cloud-secops-engineer-08662e13-698f-4383-a09f-7fcdc12914e7", "street": "Przyokopowa 26a"}], "description": " Cloud SecOps Engineer (80-100%)\nWarsaw, Madrid | working from home up to 60% | Reference 4989\n\n\nThe Competence Center Corporate SaaS is responsible for the operation, integration and continuous optimization of various corporate services based on public cloud solutions. Cross-functional collaboration and agile principles provide end-to-end services with a strong focus on customer satisfaction. Your expert knowledge of cloud-based implementations and high motivation enable you to adapt our custom developed cloud services to the changing and challenging customer requirements. You will work as well on international projects and be involved in day-to-day operations as a security expert.\n What You Will Do\nsupport application managers with the launch, adoption, and optimization of cloud solutions (SaaS)\ndesign and implement public cloud services (IaaS/PaaS) by developing infrastructure as code to host applications\nsecure and maintain cloud infrastructure and operate applications in the public cloud in close cooperation with the application managers\nconsult and support application managers and internal customers in security related questions/topics, as well as contributed to internal projects as an SME\n What You Bring\ndegree in computer science, engineering, science, or similar field and working experience with cloud solutions (SaaS) \nhands-on experience working with public cloud services at enterprise-level, focusing on Azure \nexperience and know-how for IT security around cloud services (IaaS/PaaS) and cloud solutions (SaaS)\nopen-minded and autonomous work attitude with a strong focus on quality and customer satisfaction \nvery good verbal and written English skills, German is a plus \n  What We Offer\nsharing the costs of sports activities \nprivate medical care \nsharing the costs of foreign language classes \nsharing the costs of professional training & courses \nlife insurance \nremote work opportunities \nflexible working time \nfruits \nintegration events \nno dress code \nvideo games at work \ncoffee / tea \nleisure zone \nextra social benefits \nholiday funds \nchristmas gifts \nsharing the commuting costs \nemployee referral program \ncharity initiatives \nemployee Assistance Program \n\n\n\nIf you have any questions, please call Gabriela Swiatek at +48 22 104 67 70.\n For this vacancy we only accept direct applications in English. \nInformujemy, że administratorem danych jest SIX Global Services AG SA z siedzibą w Warszawie, ul. Przyokopowa 26 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia... more"}, {"title": "Senior Devops Engineer", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "devops", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-senior-devops-engineer", "employment_types": [{"type": "permanent", "salary": {"from": 18000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "Docker", "level": 5}, {"name": "Terraform", "level": 5}, {"name": "AWS", "level": 5}], "remote": false, "multilocation": [{"city": "Tarnów", "slug": "splunk-senior-devops-engineer-tarnow", "street": "Centrum"}, {"city": "Katowice", "slug": "splunk-senior-devops-engineer-katowice", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-senior-devops-engineer", "street": "Długa"}], "description": "Join us as we pursue our innovative vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, our customers, having fun and most meaningfully, to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\n\nAre you passionate about working on critical systems to create tangible customer impact? Would you like the opportunity to work at a growing company that is changing the way that information is used to support business decisions? If this resonates with you, we would love to speak with you.\n\nThe Developer Platform Infrastructure organization develops robust and resilient platform solutions for building, testing and deploying Splunk's enterprise software. The teams are fast-paced, high-velocity, and use state-of-the-art technology. The focus is always on automation, solving complex challenges that span across multiple groups within Splunk, ensuring smooth and expedient services to Splunk users.\nThis is an incredible opportunity to utilize your existing system design, SaaS, cloud experience and drive the growth at Splunk.\n\nRole\n\nLead/contribute to engineering efforts from design to implementation, solving complex technical challenges around scalability, reliability and resiliency.\nDemonstrate service ownership and provide support to internal customers and stakeholders\nDesign and build advanced CI/CD infrastructure and pipelines; help teams debug and build projects and workflows\nDevelop tools and services that enable developers to quickly build and test software rapidly in a secure fashion\nMentor early career engineers provide technical and cultural guidance\nBuild a great customer experience for engineers using our Infrastructure\nProvide self-service access for engineering teams to deploy, scale and access infrastructure\nParticipate in a regular on-call rotation in support of services owned by the team.\n\nRequirements\n\nCI/CD and tooling expertise. Cloud, container and virtualization experience. Innovating and scaling secure services on-prem and different cloud providers is a plus. You will use Kubernetes, Docker, UCP, AWS/GCP, Jenkins, Gitlab, Ansible.\nData structures and algorithms. A solid grasp of data structures, algorithms, and RESTful APIs.\nObservability infrastructure expertise to ensure 24/7 operational excellence and data driven decision making.\nAbility to work with multiple programming languages. We have code in several languages, ranging from Go to Python.\nBS/MS degree in EE or CS or a related technical field or 5+ years of progressive experience.\nDesire to learn and adapt. You will constantly be learning new areas and new technologies.\nPassion. Our customers are passionate about Splunk, and we want the same from our engineers. We want you to be excited and have utmost ownership of your projects\n\n\n\nWhat we offer\n\nOpportunities to develop and grow as an engineer. We are always expanding into new areas, working with open-source projects and contributing back, and exploring new technologies.\nA team of incredibly capable and dedicated peers, all the way from engineering to product management and customer support.\nBreadth and depth. The team works in a broad problem domain where there are always new challenges or areas to solve.\nGrowth and mentorship. We believe in growing engineers through ownership and opportunities. We also believe that mentors help both sides of the equation.\nFun. We have frequent group outings and team building events. We are committed to having every employee want to give it their all, be respectful and a part of the family, and have a smile on their face while doing it.\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Senior Site Reliability Engineer", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "devops", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-senior-site-reliability-engineer", "employment_types": [{"type": "permanent", "salary": {"from": 18000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "Puppet", "level": 5}, {"name": "Terraform", "level": 5}, {"name": "AWS", "level": 5}], "remote": false, "multilocation": [{"city": "Katowice", "slug": "splunk-senior-site-reliability-engineer-katowice", "street": "Centrum"}, {"city": "Tarnów", "slug": "splunk-senior-site-reliability-engineer-tarnow", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-senior-site-reliability-engineer", "street": "Długa"}], "description": "Join us as we pursue our innovative vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, our customers, having fun and most meaningfully, to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\n\nWhat we’re looking for\nWe are looking for a Senior Site Reliability Engineer to help design and build the next generation of our large scale Cloud offering. You will be developing the internal platform and supporting the implementation of Splunk’s own Enterprise product within Splunk, used extensively within the company, and one of the largest scale systems of its size in the world.\n\n\n\nWhat you provide\n\nFamiliarity with cloud environments. We operate in AWS, GCP, and more in future. You are familiar with at least one of these, and willing to learn the rest.\nFamiliarity with SRE and devops tooling. You are familiar with terraform, puppet, and git, and have used them for managing production infrastructure.\nFamiliarity with programming languages. You are comfortable with either Python or Go, and willing to learn the other. If you already know both, that’s great!\nFamiliarity with observability systems and tools. You have experience with log management solutions like Splunk Enterprise or Elastic or similar. You also have experience with metrics management systems like Prometheus or SignalFX or similar. You don’t need to already know the Splunk products, but you must be willing to learn.\nDesire to learn and adapt. Our agile team has a lot of projects going on at once, and you'll have the opportunity to learn to navigate the code and features. You'll constantly be learning new areas and new technologies.\nPassion. Our customers are passionate about Splunk, and we want the same from our engineers. We want you to actively own your work and be excited about your projects.\nDrive for automation. You constantly consider, \"How can I automate this manual process?\" You will use Terraform to manage various cloud infrastructure resources. An understanding of Infrastructure-as-Code (IaC) and declarative configuration languages as preferred.\nKnowledge of technical excellence. You know continuous delivery, automated testing, security methodologies, system performance, and disaster recovery concepts.\nOperational excellence. Data excites you and you make decisions based on numbers rather than assumptions. If an issue arises, you strive to be alerted before our customers notice.\nKeeping calm and carrying on. Capable in navigating through a product outage, skilled in identifying performance bottlenecks, spotting anomalous system behavior, and figuring out the root cause of incidents.\nLinux proficiency. Excited to apply system administration experience and comfort in developing or creatively addressing challenges via a linux/unix console.\nSelf-sufficiency. You work independently, learn quickly, and build relationships with people easily. You do not need to have a manager supervising you closely in your day to day work, and can independently lead a project to success.\nThough not required, it is also awesome if you have built scalable secure services on cloud providers such as AWS, and have some Splunk expertise.\n\n\nWhat we provide\n\nOpportunities to develop and grow as an engineer. We are always expanding into new areas, working with open-source projects and contributing back, and exploring new technologies.\nA team of incredibly capable and dedicated peers, all the way from engineering to product management and customer support.\nGrowth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe that mentors help both sides of the equation.\nA stable, collaborative, and supportive work environment. We work in an open environment, work together to get things done, and adapt to the changing needs for the team.\nBalance. We trust our colleagues to be responsible with their time and commitment, and believe that balance helps cultivate a positive environment.\n\nWe value diversity, equity, and inclusion at Splunk and are an equal employment opportunity employer. Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws. We consider qualified applicants with criminal histories, consistent with legal requirements.   \nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Regular Data Analyst", "street": "Skierniewicka 10A", "country_code": "PL", "address_text": "Skierniewicka 10A, Warszawa", "marker_icon": "data", "workplace_type": "remote", "company_name": "core3", "company_url": "http://core3.pl", "company_size": "100+", "experience_level": "mid", "id": "core3-regular-data-analyst", "employment_types": [{"type": "b2b", "salary": {"from": 8000, "to": 15000, "currency": "pln"}}], "skills": [{"name": "Python", "level": 2}, {"name": "MS Excel", "level": 4}, {"name": "SQL", "level": 4}], "remote": true, "multilocation": [{"city": "Warszawa", "street": "Skierniewicka 10A", "slug": "core3-regular-data-analyst"}], "description": " Szukasz miejsca, które postawi na Twój rozwój? Chcesz pracować we wspierającym i otwartym zespole? Szukasz miejsca pracy, w którym Twój głos ma znaczenie? W takim razie jesteś w dobrym miejscu!\n \nWybrany kandydat/kandydatka będzie współpracować z zespołem analityków celem ustalania odpowiednich zapytań, które potem będą wdrażane jako cykliczne przetwarzanie. Wdrożenie cyklicznego przetwarzania sprowadza się do konfiguracji procesu oraz jego deploymentu.\n\nWymagamy:\n\n\n\n\n\nDobrej znajomości SQL\nZnajomości Pythona w podstawowym zakresie\nUmiejętności do wykonywania zadań analizy danych przy współpracy z analitykami\nMile widziana znajomość Airflow\nMile widziana znajomość klastra Kubernetes\n\nBrzmi ciekawie, prawda? Jeśli nie czujesz się pewnie, w którymś z wymienionych wyżej punktów - bez obaw, wszystkiego Cię nauczymy i wszystko pokażemy. Lubimy dzielić się wiedzą!\n\nOd nas dostaniesz:\n\n\n\n\n\nMożliwość pracy w najnowszych technologiach \nPrzestrzeń do eksperymentowania i realizowania własnych pomysłów,\nIndywidualną ścieżkę kariery,\nDogodną lokalizację miejsca pracy w Warszawie (tuż przy Rondzie Daszyńskiego) lub możliwość pracy zdalnej - jak wolisz,\nPracy w wewnętrznych zespołach, ale również pracy w zespołach u naszych partnerów,\nNiepowtarzalną atmosferę w pracy, imprezy i wyjścia z całym Zespołem,\nElastyczne godziny pracy.\n\nZastanawiasz się skąd takie widełki? Twoje wynagrodzenie będzie zależeć od Twojego doświadczenia - szukamy osób o różnym poziomie seniority :)\n\n\n\n\n\n\n\n\nUprzejmie informujemy, że będziemy mogli się skontaktować jedynie z wybranymi Kandydatami. \n\nInformujemy, że administratorem danych jest core3 z siedzibą w Warszawie ul. Grzybowska 80/82, biuro 403 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi ... more"}, {"title": "Engineering Manager", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "pm", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "mid", "id": "splunk-engineering-manager", "employment_types": [{"type": "permanent", "salary": {"from": 18000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "AWS", "level": 5}], "remote": false, "multilocation": [{"city": "Tarnów", "slug": "splunk-engineering-manager-tarnow", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-engineering-manager", "street": "Długa"}, {"city": "Katowice", "slug": "splunk-engineering-manager-katowice", "street": "Centrum"}], "description": "Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey.\n\n\nUBA helps security analysts quickly identify and resolve threats; delivered on customer managed resources using Kubernetes and Spark to run innovative stream processing and machine learning algorithms in near real-time.\n\n\nThis is an exciting engineering leadership role to lead and develop a team of passionate engineers. This team will deliver product features and enhancements as well as fixes and solutions to Splunk’s customers with rapid turn-around time, raising customer satisfaction. We are looking for a leader that has both strong technical abilities and experience building relationships with the Customer Success, Support, and the Field organization. Furthermore, the manager will play a vital role in product innovation by working closely with product management and other engineering teams to build and enhance the Splunk product in terms of new features with quality, diagnosability, and usability at the forefront.\n\n\nAs a leader in the UBA Engineering group, you'll also be deeply involved in roadmap planning, structuring our organization, and collaborating with a large network of software and security professionals. Splunk's teams are distributed in multiple locations; the right candidate will need to have excellent communication and leadership skills which transcend the geographic divides.\n\n\nWhat We Offer You:\n\nA constant stream of new things for you to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies.\nA set of exceptionally talented and dedicated peers, all the way from engineering and QA to product management and customer support.\nGrowth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation.\nA stable, collaborative and supportive work environment.\n\nResponsibilities:\n\nLead a team of high skilled frontend and backend engineers and serve as coach, mentor and technical adviser.\nWorking closely with the rest of the leadership and product management team on product strategy and roadmap refinement with the customer first thinking.\nPassionate about good engineering practices, new technologies, and improving processes, and a consistent record of mentoring and coaching team members.\nLead the creation of features and product releases by being closely involved with the product development, design, and review.\nExperience developing and delivering scalable enterprise products.\nCI/CD is a top priority for us as we further mature our development model. A successful manager will champion code quality among the team by actively participating in code reviews, test plan development, and holding ourselves accountable for writing appropriate automated tests.\nWork closely with developers and architects on technical decisions throughout the development lifecycle.\nWork with other team leads from across the product organization on inter-area projects, help identify the critical paths of components, and resolve dependencies.\nHold regular 1:1s with direct reports, help them navigate challenges, and coach them for their career development.\nPlan & implement strategies to help team align with the organizational goals.\n\nRequirements:\n\n5+ years of experience in product engineering leadership roles directly managing highly technical engineers.\nAble to build teams by attracting & retaining talent in a fiercely competitive environment.\n\nNice to have skills\n\nExperience working in or leading engineering teams distributed across geographies and timezones.\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which you are applying.\n\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Senior Infrastructure Engineer", "street": "Eurocentrum", "country_code": "PL", "address_text": "Eurocentrum, Warszawa", "marker_icon": "admin", "workplace_type": "partly_remote", "company_name": "Spark", "company_url": "http://www.sparkbrighterthinking.com", "company_size": "190", "experience_level": "senior", "id": "spark-senior-infrastructure-engineer-74fa0e19-36df-4d04-888e-64ada906257a", "employment_types": [{"type": "permanent", "salary": {"from": 16000, "to": 18000, "currency": "pln"}}], "skills": [{"name": "Linux OS", "level": 3}, {"name": "Azure", "level": 3}, {"name": "DevOps", "level": 3}], "remote": false, "multilocation": [{"city": "Łódź", "slug": "spark-senior-infrastructure-engineer-11284784-5c24-41e6-a176-2737639b2320", "street": "Centrum"}, {"city": "Warszawa", "slug": "spark-senior-infrastructure-engineer-74fa0e19-36df-4d04-888e-64ada906257a", "street": "Eurocentrum"}], "description": "Information Systems are a key aspect of the Spark strategy, a hands-on Infrastructure Engineer is imperative in a multi-tiered approach to our infrastructure that supports the business.\n The Infrastructure Engineer will be responsible for providing 3rd line support to the business working closely with the VP of Information Systems.  The Infrastructure Engineer will work closely with the VP in order to help deliver key projects, to identify, recommend, develop, implement, and support cost-effective technology solutions for all aspects of the organisation. The candidate will work with the DevTeam to support and help with the development of the Hosting platform, particularly with the move to a Kubernetes architecture.\n The candidate should be able to demonstrate practical experience in a similar role.\n This role is predominantly a working-from-home role but there will be requirements to visit the office in Warsaw as the role requires.\n There may also be a requirement to travel abroad to different sites as needed. \n\nPRINCIPAL ACCOUNTABILITIES\nSystem/Application/Network Support\n  Own the build, configuration and ongoing support of IT physical and cloud Infrastructure platforms including network, servers, storage, end user compute and security solutions.\nWorking closely with the VP of IS to assist in the design of a secure, robust, scalable and high performing cloud and office network infrastructure.\nMaintenance of technical documentation to support project delivery and the ongoing operation of our infrastructure services.\nEffective monitoring of infrastructure and network services to ensure business systems availability and performance.\nDealing with infrastructure and network support tickets ensuring timely resolution in line with business requirements.\nISO compliance experience and implementation.\n\nQualifications and Skills\nThe desired qualifications and skills of the Infrastructure Engineer are:\n  3+ years experience in implementing and supporting infrastructure.\nAzure and AWS build and administration experience with an understanding of security layers like VPCs/NACLs, Security Groups, IAM roles, etc\nMicrosoft Windows Server\nLinux OS\nServer and application configuration management experience including patch management\nPowerShell scripting\nPRTG management\nAzure AD configuration and administration\nCisco Networking - LAN Switching, WLAN (Fortinet),\nFortinet Firewall administration\nNative level fluency in written and spoken English\n\nOperational \nSupport the Dev Team with DevOps services and knowledge, participate in the move to Kubernetes.\nDealing with hardware and infrastructure support queries and issues assigned to the Infrastructure Engineer from the central service desk\nStrong security knowledge and keeping up to date with the latest threats and vulnerabilities\nProvide local user data and application recovery \nSupport of the local IT 1st and 2nd line support engineers as necessary and directed\nStrong project management skills will be required for various initiatives to be undertaken this year\nPerforms other related tasks as assigned by management\nMaintains and consistently demonstrates a general knowledge of Spark guidelines, processes, practices and procedures \nWorking hours as required to do your job but not less than 37.5 hours per week\nInformujemy, że administratorem danych jest AGI World Lid trading as Spark z siedzibą w Warszawa, Eurocentrum Office Complex Al. Jerozolimskie 136 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do p... more"}, {"title": "SALESFORCE DEVELOPER", "street": "Karola Szajnochy 5/1", "country_code": "PL", "address_text": "Karola Szajnochy 5/1, Warszawa", "marker_icon": "other", "workplace_type": "remote", "company_name": "ITligent", "company_url": "https://www.facebook.com/ITligent", "company_size": "50", "experience_level": "senior", "id": "itligent-salesforce-developer", "employment_types": [{"type": "b2b", "salary": {"from": 6200, "to": 6700, "currency": "eur"}}], "skills": [{"name": "Commerce Cloud", "level": 4}, {"name": "Sales Cloud", "level": 4}, {"name": "Salesforce", "level": 5}], "remote": true, "multilocation": [{"city": "Bydgoszcz", "slug": "itligent-salesforce-developer-bydgoszcz", "street": "Centrum"}, {"city": "Gdańsk", "slug": "itligent-salesforce-developer-gdansk", "street": "Centrum"}, {"city": "Warszawa", "slug": "itligent-salesforce-developer", "street": "Karola Szajnochy 5/1"}, {"city": "Łódź", "slug": "itligent-salesforce-developer-lodz", "street": "Centrum"}, {"city": "Szczecin", "slug": "itligent-salesforce-developer-szczecin", "street": "Centrum"}, {"city": "Wrocław", "slug": "itligent-salesforce-developer-wroclaw", "street": "Centrum"}, {"city": "Poznań", "slug": "itligent-salesforce-developer-poznan", "street": "Centrum"}, {"city": "Białystok", "slug": "itligent-salesforce-developer-bialystok", "street": "Centrum"}, {"city": "Rzeszów", "slug": "itligent-salesforce-developer-rzeszow", "street": "Centrum"}, {"city": "Kraków", "slug": "itligent-salesforce-developer-krakow", "street": "Centrum"}], "description": "👉 CONTRACT B2B: MIDDLE / SENIOR\n👉 FEE: 6200 - 6700 Euro net\n👉 START: ASAP / 1 MONTH / MAX. 05.2023\n\nWe are looking for 3 experienced Salesforce developers for a long-term project for one of our clients.\n\nOur expectations\n✔️ Experience: min 3 years of commercial exp\n✔️ Senior - commercial exp\" + 5 years\n✔️ English - as a minimum B2, preferred: C1\n✔️ Experience in international projects (n2h)\n✔️ Recommended SF certifications\n✔️ Nationality is irrelevant / EU based location is needed\n\nAbout the offer in general\n▶️ Implementation and development of the application\n▶️ Stable project, international team\n▶️ MMultidisciplinary team, well managed\n▶️ Long-term project, sstable, not a startup, solid financial foundation\n\nStack:\n🔶 Sales Force\n🔶 Sales Cloud\n🔶 Commerce Cloud\n🔶 Apex\n🔶 Aura Compnents\n🔶 Ant\n🔶 LWC\n🔶 RestAPI,\n🔶 Jest\n\nOffer in general\n✅ Contract B2B B2B\n✅ 100% remote\n✅ Fulltime\n✅ Monthly fee: 6200 - 6700 Euro net\n✅ Start: Asap / 1 month / max. 05.2023\n✅ Long-term\n\nInformujemy, że administratorem danych jest ITLigent Grou Sp. z o.o. z siedzibą w Warszawie, Al. Jana Pawła II 17, (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesien... more"}, {"title": "Cybersecurity Software Engineer", "street": "ul. Wojska Polskiego 4", "country_code": "PL", "address_text": "ul. Wojska Polskiego 4, Mielec", "marker_icon": "security", "workplace_type": "remote", "company_name": "BURY", "company_url": "https://www.bury.com/pl/", "company_size": "2200+", "experience_level": "mid", "id": "bury-cybersecurity-software-engineer", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "English", "level": 1}, {"name": "Automotive", "level": 4}, {"name": "ISO 21434", "level": 4}], "remote": true, "multilocation": [{"city": "Warszawa", "slug": "bury-cybersecurity-software-engineer-warszawa", "street": "Centrum"}, {"city": "Kraków", "slug": "bury-cybersecurity-software-engineer-krakow", "street": "Centrum"}, {"city": "Mielec", "slug": "bury-cybersecurity-software-engineer", "street": "ul. Wojska Polskiego 4"}, {"city": "Katowice", "slug": "bury-cybersecurity-software-engineer-katowice", "street": "Centrum"}], "description": "Zakres obowiązków:\n\nDziałanie jako ekspert obszarowy i punkt kontaktowy dla zespołów programistycznych w zakresie cyberbzpieczeństwa produktu\nTworzenie i wdrażanie najlepszych praktyk w zakresie bezpieczeństwa oprogramowania\n Doradztwo i wsparcie  podczas etapu tworzenia architektury oprogramowania w projekcie, ze szczególnych uwzględnieniem potencjalnych zagrożeń od strony cyberbezpieczeństwa \nPrzeprowadzanie przeglądów kodów źródłowych dotyczących cyberbezpieczeństwa \nKoncepcja i wykonywanie testów podatności zabezpieczeń \nPrzygotowanie produktów pracy wynikających z ISO/SAE 21434 na poziomie operacyjnym\nNadzór w obszarze cyberbezpieczeństwa nad cyklem  tworzenia oprogramowania i ewentualnie po okresie wdrożenia do produkcji\nProwadzenie szkoleń w zakresie cyberbezpieczeństwa\n Oczekiwania wobec Kandydatów:\n   Wykształcenie wyższe \nZnajomość programowania (C,C ++ itp.) oraz języków skryptowych (Python, bash itp) \nDoświadczenie w inżynierii bezpieczeństwa (security) lub wiedza w zakresie inżynierii cyberbezpieczeństwa \nZnajomość systemów operacyjnych, systemów wbudowanych\nDoświadczenie z narzędziami do statycznej analizy kodu\n Oferujemy:\n  Zatrudnienie na podstawie umowy o pracę lub kontrakt B2B\nMożliwość pracy zdalnej\nPracę w międzynarodowym środowisku\nMożliwości rozwoju i zdobycia doświadczenia\nMożliwość bezpośredniego kontaktu z klientami w branży motoryzacyjnej OEM\nUdział w ciekawych i różnorodnych projektach\nPracę w kreatywnym, twórczym i przyjaznym zespole\nDofinansowane przez firmę karty MultiSport, ubezpieczenie grupowe, prywatna opieka medyczna, nauka języków obcych w godzinach pracy, imprezy integracyjne, brak dress code, miejsce parkingowe dla pracowników, inicjatywy charytatywne\nAdministratorami Pani/Pana danych osobowych są Bury sp. z o. o. z siedzibą w Mielcu, ul. Wojska Polskiego 4, 39-300 Mielec oraz Research and Development Center Bury sp. z o. o. z siedzibą w Mielcu, ul. Wojska Polskiego 4, 39-300 Mielec. Bury sp. z o. o. i Research and Development Center Bury sp. z o. o. dokonują współadministrowania danych osobowych Kandydatów (... more"}, {"title": "Functional Safety Engineer", "street": "ul. Wojska Polskiego 4", "country_code": "PL", "address_text": "ul. Wojska Polskiego 4, Mielec", "marker_icon": "architecture", "workplace_type": "remote", "company_name": "BURY", "company_url": "https://www.bury.com/pl/", "company_size": "2200+", "experience_level": "mid", "id": "bury-functional-safety-engineer", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "English", "level": 4}, {"name": "Automotive", "level": 4}, {"name": "ISO26262", "level": 4}], "remote": true, "multilocation": [{"city": "Kraków", "slug": "bury-functional-safety-engineer-krakow", "street": "Centrum"}, {"city": "Warszawa", "slug": "bury-functional-safety-engineer-warszawa", "street": "Centrum"}, {"city": "Katowice", "slug": "bury-functional-safety-engineer-katowice", "street": "Centrum"}, {"city": "Mielec", "slug": "bury-functional-safety-engineer", "street": "ul. Wojska Polskiego 4"}], "description": "Zakres obowiązków:\n\nAnaliza systemu pod kątem wymagań ASIL\nWspółudział przy tworzeniu Analizy Możliwości Wymagań\nWspółudział przy tworzeniu Architektury Systemu\nTworzenie konceptów realizujących wymagania bezpieczeństwa\nWspółudział przy tworzeniu analizy ryzyka (FMEA)\nDefiniowanie wymagań bezpieczeństwa jak również metod ich weryfikacji\nWspółtworzenie konceptów weryfikacji oraz walidacji systemu szczególnie pod kątem wymagań bezpieczeństwa\nOrganizowanie i moderowanie weryfikacji produktów pracy poświęconych aspektom opisanym w wymaganiach bezpieczeństwa\n\nOczekiwania wobec Kandydatów:\n\nUkończone studia o profilu Elektronika, Inżynieria bezpieczeństwa, Informatyka, Matematyka\nDoświadczenie zawodowe przy rozwoju Systemów lub Komponentów w branży motoryzacyjnej\nBardzo dobra znajomość obszarów dotyczących metod pomiarów oraz weryfikacji \n Znajomość procesów A-SPICE, IATF\nZnajomość norm i standardów jak ISO2626. ISO27001, IEC61508\nBardzo dobra znajomość języka angielskiego. Znajomość języka niemieckiego będzie dodatkowym atutem\n Umiejętność pracy w zespole\nWysoko rozwinięte umiejętności komunikacyjne\n\nOferujemy:\n  Zatrudnienie na podstawie umowy o pracę lub umowy B2B\nMożliwość pracy zdalnej\nPracę w międzynarodowym środowisku\nMożliwości rozwoju i zdobycia doświadczenia\nMożliwość bezpośredniego kontaktu z klientami w branży motoryzacyjnej OEM\nUdział w ciekawych i różnorodnych projektach\nPracę w kreatywnym, twórczym i przyjaznym zespole\nDofinansowane przez firmę karty MultiSport, ubezpieczenie grupowe, prywatna opieka medyczna, nauka języków obcych w godzinach pracy, imprezy integracyjne, brak dress code, miejsce parkingowe dla pracowników, inicjatywy charytatywne\nAdministratorami Pani/Pana danych osobowych są Bury sp. z o. o. z siedzibą w Mielcu, ul. Wojska Polskiego 4, 39-300 Mielec oraz Research and Development Center Bury sp. z o. o. z siedzibą w Mielcu, ul. Wojska Polskiego 4, 39-300 Mielec. Bury sp. z o. o. i Research and Development Center Bury sp. z o. o. dokonują współadministrowania danych osobowych Kandydatów (... more"}, {"title": "ETL Developer", "street": "Wielicka 28", "country_code": "PL", "address_text": "Wielicka 28, Kraków", "marker_icon": "admin", "workplace_type": "remote", "company_name": "Erbis", "company_url": "http://www.erbis.com", "company_size": "50-200", "experience_level": "mid", "id": "erbis-ms-sql-etl-engineer-krakow", "employment_types": [{"type": "b2b", "salary": {"from": 20000, "to": 25000, "currency": "pln"}}, {"type": "permanent", "salary": {"from": 16000, "to": 20000, "currency": "pln"}}], "skills": [{"name": "Azure", "level": 4}, {"name": "SQL", "level": 5}, {"name": "ETL", "level": 5}], "remote": true, "multilocation": [{"city": "Katowice", "slug": "erbis-etl-developer-b1ee3631-bee7-434c-9dac-6cd284be1951", "street": "Centrum"}, {"city": "Łódź", "slug": "erbis-etl-developer-bcb07d45-fcbd-46f6-b084-8bf1fac7aa4e", "street": "Centrum"}, {"city": "Poznań", "slug": "erbis-etl-developer-591ee40e-f9ec-4fd6-9a37-fcd5def6742a", "street": "Centrum"}, {"city": "Kraków", "slug": "erbis-ms-sql-etl-engineer-krakow", "street": "Wielicka 28"}, {"city": "Wrocław", "slug": "erbis-etl-developer-5c8a71b2-5f91-4e1d-a2ac-f07c928e3c7d", "street": "Centrum"}, {"city": "Warszawa", "slug": "erbis-etl-developer-tarnow", "street": "Centrum"}], "description": "WHO WE ARE\n\nHi! We are Erbis, a full-cycle development team building innovative solutions to help entrepreneurs and enterprises change the world for the better.\n\nWe are looking for an experienced and driven database engineer to join the team building and managing the data infrastructure necessary to make education a more data-informed industry. This individual will be a critical contributor to a fast-growing, early-stage education technology business and will have the unique benefit of joining a supportive team of experienced professionals on the ground level. Individual will support and maintain complex data storage systems and will be responsible for all aspects of development, performance tuning and monitoring.\n\nOUR CLIENT\n\nUS-based data-driven business that serves colleges and universities. They help educational institutions drive their success with transparency of data, both across departments on campus and across the higher education marketplace. Our client leverage real-time student record-level data to visualize opportunities and provide analytics that highlight areas for improvement.\n\nRESPONSIBILITIES:\n\nLeverage analytic and technical skills to support ingestion and normalization of data from colleges and universities, ultimately making large and complex data sets more usable for our campus partners\nAssist with software deployment and management of the technical infrastructure\nSupport ETL processes to load data to Azure SQL and Azure Data Lake utilizing\nUtilize SQL Data Tools to build ETL processes and solutions\nCreate Azure Databricks notebooks for ETL/ELT flow in modern DWH\nSupport and enhance business intelligence development efforts by translating business needs to technical specifications\nCreate technical documentation for databases to assist other team members and aid in onboarding new employees\nCollaborate with the data and analytics team as well as the client service team in support of our partners\nUphold the highest standards for data quality and integrity\n\nMINIMUM REQUIREMENTS:\n\nBachelor’s degree in computer science, information technology or related field or a database certification\nExperience developing in the Microsoft Azure cloud computing platform including Azure Data Factory (ADF), Data Bricks, and Azure Functions\nExperience developing in Azure SQL\nExperience working with data in Python\nExtensive experience testing and troubleshooting to solve complex technical problems\nImpressive interpersonal and verbal communication skills\nAbility to multitask and prioritize tasks appropriately\n\nPREFERRED QUALIFICATIONS:\n\nExperience working with large databases and developing data warehouses\nExperience working with Data Bricks notebooks for automated data processing\nExperience designing and developing dimensional models\nExcellent customer relationship skills\n\nWE HAVE SOME PERKS & BENEFITS. YOU CAN:\n\nChoose the comfortable working mode with the hybrid working model\nGet recharge with a paid PTO\nGain new skills with 10% of the time available for education\nJoin company parties, cultural, and sports events\nParticipate in our Bring Your Own Device Program\n\n\n\nInformujemy, że administratorem danych jest PANECS EUROPE LIMITED z siedzibą na Cyprze, ul. Strovolou, 77/204, Strovolos Center, Floor 2, 2018, Strovolos, Nicosia, (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a... more"}, {"title": "Analityk Biznesowo-Systemowy", "street": "Wacława Sieroszewskiego 12/3", "country_code": "PL", "address_text": "Wacława Sieroszewskiego 12/3, Gdynia", "marker_icon": "analytics", "workplace_type": "remote", "company_name": "Get IT Dan Sp. z o.o.", "company_url": "http://www.getitdan.pl", "company_size": "60-100", "experience_level": "mid", "id": "get-it-dan-sp-z-o-o-analityk-biznesowo-systemowy", "employment_types": [{"type": "b2b", "salary": null}], "skills": [{"name": "Power Platform", "level": 1}, {"name": "MS Project", "level": 1}, {"name": "UML", "level": 3}], "remote": true, "multilocation": [{"city": "Warszawa", "slug": "get-it-dan-sp-z-o-o-analityk-biznesowo-systemowy-warszawa", "street": "Centrum"}, {"city": "Poznań", "slug": "get-it-dan-sp-z-o-o-analityk-biznesowo-systemowy-poznan", "street": "Centrum"}, {"city": "Gdańsk", "slug": "get-it-dan-sp-z-o-o-analityk-biznesowo-systemowy-gdansk", "street": "Centrum"}, {"city": "Gdynia", "slug": "get-it-dan-sp-z-o-o-analityk-biznesowo-systemowy", "street": "Wacława Sieroszewskiego 12/3"}], "description": "Obecnie dla Get IT Dan, Linii PPM, poszukujemy osoby na stanowisko Analityka Biznesowo-Systemowego:\n\nCo zyskasz pracując z nami:\n\nFormę współpracy w oparciu o kontrakt b2b z Get IT Dan\nPracę w pełni zdalną z możliwością wizyt w biurze w Warszawie lub Gdyni\nElastyczny wymiar zaangażowania\nNiezbędne narzędzia pracy\nOkazję do ciągłego rozwoju\n\nJakie kompetencje są niezbędne:\n\nWykształcenie wyższe\n2-letnie doświadczenie w roli Analityka biznesowego lub systemowego (lub podobnej roli)\nPraktyczna znajomość systemów MS Project Online oraz MS Project Server, obejmująca prace przy projektach wdrożeniowych wyżej wymienionych systemów\nZnajomość Microsoft Power Platform (w szczególności Power Apps oraz Power Automate)\nOgromnym plusem będzie posiadanie certyfikatów:\nMicrosoft Specialist Managing Project and Portfolios with Project Server \nMicrosoft Specialist Managing Project with Microsoft Project \nMicrosoft Certified Solutions Expert SharePoint\nZnajomość metodyk wytwarzania oprogramowania\nUmiejętność pisania dokumentacji oraz prowadzenia prezentacji i szkoleń\nZnajomość technik dokumentacji wymagań oraz analizy biznesowej opartej o światowe standardy i metodyki (UML 2.*, BPMN 2, narzędzia CASE)\n\nZa co będziesz odpowiedzialna/y:\n\nZbieranie i dokumentowanie wymagań w zakresie systemów informatycznych\nWypracowywanie rozwiązań na podstawie zebranych wymagań\nPrzygotowywanie wdrażanych rozwiązań w zakresie konfiguracji systemu\nŚcisłą współpracę z Biznesem oraz zespołem wytwórczym/wdrożeniowym\nAnalizę wymagań użytkownika i przekładanie wymagań na elementy rozwiązania systemowego\nModelowanie procesów i dziedziny wdrażanych w systemie\nWsparcie zespołu testowego w obszarze rozumienia wymagań i przełożenia na elementy procesu testowego oraz współpraca w zakresie analizy błędów\nAdministratorem danych osobowych jest Get IT Dan sp. z o.o. zarejestrowana w Gdyni ul. Sieroszewskiego 12/3, 81-376 Gdynia. Ze specjalistą ochrony danych można kontaktować się pod adresem email: biuro@getitdan.pl. Dane osobowe przetwarzane będą na podstawie art. 6 ust. 1 lit a) RODO Rozporządzenia Parlamentu Europejskiego i Rady (UE) 2016/679 z dnia 27 kwietnia ... more"}, {"title": "Golang Developer (Poland/remote)", "street": "Centrum", "country_code": "PL", "address_text": "Centrum, Warszawa", "marker_icon": "go", "workplace_type": "remote", "company_name": "Halo Radius, Inc.", "company_url": "https://haloradius.com/", "company_size": "25", "experience_level": "senior", "id": "halo-radius-inc-golang-developer", "employment_types": [{"type": "b2b", "salary": {"from": 4000, "to": 6000, "currency": "usd"}}], "skills": [{"name": "AWS", "level": 1}, {"name": "cicd", "level": 3}, {"name": "Golang", "level": 4}], "remote": true, "multilocation": [{"city": "Poznań", "slug": "halo-radius-inc-golang-developer-poland-remote-59e236ce-8a0d-4bd9-bcaa-c0d912b711b4", "street": "Centrum"}, {"city": "Szczecin", "slug": "halo-radius-inc-golang-developer-poland-remote-szczecin", "street": "Centrum"}, {"city": "Gdańsk", "slug": "halo-radius-inc-golang-developer-poland-remote-gdansk", "street": "Centrum"}, {"city": "Lublin", "slug": "halo-radius-inc-golang-developer-poland-remote-lublin", "street": "Centrum"}, {"city": "Kraków", "slug": "halo-radius-inc-golang-developer-poland-remote-poznan", "street": "Centrum"}, {"city": "Wrocław", "slug": "halo-radius-inc-golang-developer-poland-remote", "street": "Centrum"}, {"city": "Katowice", "slug": "halo-radius-inc-golang-developer-poland-remote-4a6d2719-1577-4409-986d-936357f93670", "street": "Centrum"}, {"city": "Warszawa", "slug": "halo-radius-inc-golang-developer", "street": "Centrum"}, {"city": "Toruń", "slug": "halo-radius-inc-golang-developer-poland-remote-torun", "street": "Centrum"}, {"city": "Łódź", "slug": "halo-radius-inc-golang-developer-poland-remote-lodz", "street": "Centrum"}], "description": "Hewlett Packard Enterprise advances the way people live and work. We bring together curious minds to create breakthrough technology solutions, helping our customers make their mark on the world.\n\nThe Poland team is working closely with the Bristol team as a key part of the global HPE Storage business. We work across multiple areas of technology, we create cutting-edge software products, and we want you to be a part of our team.\n\nOur engineers love what they do. They love solving problems and seeking out innovative solutions to a wide variety of problems. Our engineers are great software developers. We don’t like doing things twice, we like to ensure we get it right the first time and automate where possible.\n\nWe are currently in search of Software Developers to work on our next generation of cloud products. You’ll be working on some incredibly exciting tech, taking responsibility for the design, development, troubleshooting, programming, and integration of some of our cutting-edge products. This is a fantastic opportunity to engage in a positive and creative work environment that offers excellent benefits and a flexible work schedule.\n\nIf you have a track record in and a passion for software engineering, want to be part of a business that is growing—with great opportunities, and are ready for your next role, then please apply today.\n\nWhat we can offer you:\n\nStart-up mentality in our day-to-day work, coupled with the benefits and opportunities of a leading global technology company\nThe chance to work on our cutting-edge technology, making a tangible difference to the products you’re working on\nParticipation in the shared values and purpose that make Hewlett Packard Enterprise one of the world´s most attractive employers\n\nWhat you’ll bring…\n\nExperience in Golang\nExperience with Cloud technologies (AWS/Azure preferred) \nKnowledge of Kubernetes and Docker\nExperience with building microservices-oriented architecture\nUnderstanding of Software development processes and practice\nStrong analytical and problem-solving skills\nAbility to work effectively as an individual, as part of a local team, and as part of a global development community\n\nEducation and Experience Required:\n\n\nBachelor's or Master's degree in Computer Science, Information Systems, or equivalent.\nInformujemy, że administratorem danych jest Halo Radius, Inc. z siedzibą w Dover Delaware, ul. 8 The Green Suite #12642 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wni... more"}, {"title": "Senior C++ Developer", "street": "Lotnicza 12", "country_code": "PL", "address_text": "Lotnicza 12, Wrocław", "marker_icon": "c", "workplace_type": "remote", "company_name": "Nokia", "company_url": "http://nokiawroclaw.pl/en/", "company_size": "3000+", "experience_level": "senior", "id": "nokia-senior-c-developer-c4484b21-7cf4-4842-869a-074ade0aa12e", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "C++ 14", "level": 3}, {"name": "C++ 11", "level": 3}, {"name": "C++", "level": 4}], "remote": true, "multilocation": [{"city": "Poznań", "slug": "nokia-senior-c-developer-b312119a-8aaa-475a-a072-5d2c396993f0", "street": "Centrum"}, {"city": "Gdańsk", "slug": "nokia-senior-c-developer-460ae7d4-3542-43b0-be09-e144c626b287", "street": "Centrum"}, {"city": "Wrocław", "slug": "nokia-senior-c-developer-c4484b21-7cf4-4842-869a-074ade0aa12e", "street": "Lotnicza 12"}, {"city": "Warszawa", "slug": "nokia-senior-c-developer-251dae4d-2b55-4a63-b22b-fa0d09db56a5", "street": "Centrum"}, {"city": "Lublin", "slug": "nokia-senior-c-developer-96036e91-ad61-463a-831d-9ba738ab9a1f", "street": "Centrum"}, {"city": "Łódź", "slug": "nokia-senior-c-developer-2fdb89a0-6910-4a85-85d2-edea73f6d930", "street": "Centrum"}, {"city": "Szczecin", "slug": "nokia-senior-c-developer-c9f2326b-7955-40eb-bbd4-12763e0eff60", "street": "Centrum"}, {"city": "Bydgoszcz", "slug": "nokia-senior-c-developer-38fbe00c-e349-4dc3-aea5-154579071c25", "street": "Centrum"}, {"city": "Katowice", "slug": "nokia-senior-c-developer-f4ed7e42-c7b4-4baa-b0ae-19c6d4dc909d", "street": "Centrum"}, {"city": "Kraków", "slug": "nokia-senior-c-developer-2dc4d5ea-1257-4622-aef3-67cc244860ac", "street": "Centrum"}], "description": "Come create the technology that helps the world act together\nNokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. \nWe challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work.\n Are you ready to start your adventure with Nokia?\nWe are currently the largest institution of research and development in the ICT sector in Poland, successively growing and still looking for new talents. C++ Developer is one of the key positions in R&D Centers in Poland and at present, there are a few slightly different departments possibly interested in your experience. This is one of the key positions in R&D Center in Kraków and at present, there are a few slightly different departments possibly interested in your experience. Apply today and help us to build the fastest 5G technology that connects the world.\n\nWhat you will learn and contribute to\nCreating and reviewing requirements for functional, design and interface specifications based on system and HW specifications\nDeveloping, and implementing software utilizing the latest software best practices\nAnalyzing and solving complex engineering problems and hitches in radio technologies area\nDaily cooperation with project managers in planning activities\nMentoring other members of the team\n Your skills and experience\nYou have:\nStrong commercial experience in C++\nExpertise in algorithm optimization, code profiling and in analysis of memory usage violations\nExcellent analysis and problem-solving skills \nKnowledge of Boost and STL C++ Libraries\nGood communication in English (both written and spoken)\n\nIt would be nice if you also had:\nPython/Bash is an advantage\nExperience in software development for telecommunication field in: 5G or LTE or 3G systems and 3GPP\nExperience with C++ embedded\n\nTechnologies we work with:\nC++11/14/17\nGCC, Clang\nLinux\nTesting frameworks\nJIRA\nVersion control and code review systems (Git/Gerrit)\nContinuous Integration systems\n  What we offer\nNokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n\nNokia is committed to inclusion and is an equal opportunity employer\nNokia has received the following recognitions for its commitment to inclusion & equality:\n\nOne of the World’s Most Ethical Companies by Ethisphere\nGender-Equality Index by Bloomberg\nWorkplace Pride Global Benchmark\nLGBT+ equality & best place to work by HRC Foundation\n At Nokia, we act inclusively and respect the uniqueness of people.\nNokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\nWe are committed to a culture of inclusion built upon our core value of respect.\n\nJoin us and be part of a company where you will feel included and empowered to succeed.\nInformujemy, że administratorem danych jest Nokia Solutions and Networks Sp. z o.o. z siedzibą w Warszawie, ul. Rodziny Hiszpańskich 8 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia ... more"}, {"title": "Senior Backend Engineer (Remote)", "street": "Nørrebrogade 45e", "country_code": "DK", "address_text": "Nørrebrogade 45e, København", "marker_icon": "javascript", "workplace_type": "remote", "company_name": "ChurchDesk", "company_url": "https://churchdesk.com", "company_size": "30-40", "experience_level": "senior", "id": "churchdesk-senior-backend-engineer-remote-ok", "employment_types": [{"type": "b2b", "salary": {"from": 4500, "to": 5000, "currency": "eur"}}], "skills": [{"name": "JavaScript", "level": 4}, {"name": "Web Applications", "level": 4}, {"name": "Node.js", "level": 5}], "remote": true, "multilocation": [{"city": "Kraków", "slug": "churchdesk-senior-backend-engineer-remote-ok-krakow", "street": "Centrum"}, {"city": "Warszawa", "slug": "churchdesk-senior-backend-engineer-remote-ok-warszawa", "street": "Centrum"}, {"city": "Wrocław", "slug": "churchdesk-senior-backend-engineer-remote-ok-wroclaw", "street": "Centrum"}, {"city": "København", "slug": "churchdesk-senior-backend-engineer-remote-ok", "street": "Nørrebrogade 45e"}], "description": "We are looking for an experienced (6+ years) Node.js engineer with a track record of delivering good products, a passion for sharing knowledge and who enjoys a collaborative and fast-paced environment.\n\nWhat you will do\nAs a person, you are very hands-on and enjoy getting things done while understanding that we win as a team. As a senior, you take an active role in growing our team's capabilities both in terms of skills, best practices and architectural decisions.\nWe build our backend using reliable tools that our team knows and trusts, including Node.js, Express, Typescript, MySQL, ElasticSearch and Redis.\n\nWorking at ChurchDesk\nOur customers are some of the largest and oldest institutions in the world. The church is changing to prepare for the future and we are here to help them. It's critical for them to improve how they work and stay connected to their members and communities.\nWe have been around for 10 years and have grown across Europe from a startup to an international business, but we still have a lot of work ahead of us. Join us to work on a big opportunity, have fun at work and develop both yourself and your career.\n\nWhat we offer\nWe’re an international collaborative tech team of 8 people who genuinely enjoy working together to make ChurchDesk a better product. In this role, you will be able to make a big impact. We are low on ceremony and keep lean processes.\nGreat social environment. Annual company kick-off and team trips to ensure we get together as a full team on a quarterly basis.\n6 weeks paid vacation and recommend everyone to take a 3-week well-earned summer break.\nOur frontend stack is React and we welcome cross-team work.\n\nChurchDesk is not a religious company. We help develop and transform some of the largest institutions in the world with more than a billion members.\n\nJob requirements\n6 years of experience with software development and Node.js.\n3 years of experience testing, maintaining or launching software products, and 1 year of experience with software design and architecture.\nDeep understanding of relational database systems, specifically MySQL.\nUnderstanding NoSQL Datastores such as ElasticSearch, Redis and MongoDB is a plus.\nExperience building scalable, performant, and modular solutions.\nClear and concise communication skills.\nYou have to be based in the EU. Alas, we're not set up to hire outside of the EU since we believe that it's imperative that we meet in person once in a while.\nAt least one year of remote experience is required if you prefer to work remotely.\nInformujemy, że administratorem danych jest ChurchDesk z siedzibą w Copenhagen, ul. Nørrebrogade 45e (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do o... more"}, {"title": "Software Engineer Python / C++", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "python", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "mid", "id": "splunk-software-engineer-python-c", "employment_types": [{"type": "permanent", "salary": {"from": 14000, "to": 18000, "currency": "pln"}}], "skills": [{"name": "AWS", "level": 4}, {"name": "C++", "level": 4}, {"name": "Python", "level": 4}], "remote": false, "multilocation": [{"city": "Kraków", "slug": "splunk-software-engineer-python-c", "street": "Długa"}, {"city": "Katowice", "slug": "splunk-software-engineer-python-c-katowice", "street": "Centrum"}, {"city": "Tarnów", "slug": "splunk-software-engineer-python-c-tarnow", "street": "Centrum"}], "description": "Join us as we pursue our vision to make the world a place where data provides clarity, elevates discussion, and accelerates progress for everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey.\n\n\nRole:\n\n\nOur goal is to remove the barriers between data and action, and provide people with the access to informative, predictive, relevant, and actionable data via the Splunk platform. This team focuses on Splunk Application Management, who are integral in the adoption and successful use of Splunk’s platform.\n\n\nWe are looking for an extraordinary software engineer to drive the technical direction and implementation of the Splunk Cloud application management experiences. You thrive in a dynamic environment and have a proven record of software delivery. This role requires cross-team collaboration with our product management, user experience, and documentation teams, as well as technical leaders from other engineering teams.\n\n\nResponsibilities:\n\nDevelops and owns moderate complexity features or sub-systems.\nDesigns for testability. Automates effective test cases, and can make necessary test framework improvements as required.\nBreaks down a complex task and estimates sprint sized software deliverables\nAnalyze and optimize back-end code, and pursue simplicity, efficiency, reliability and performance.\nUse independent judgment to take existing code, understand its function and change/improve as needed.\nEngage in design and code reviews of the product, and use your knowledge of customers’ experiences to dedicatedly prevent future problems.\n\nRequirements:\n\n2+ years of experience with a BS EE or CS degree, or equivalent training or work experience.\nSolid knowledge of Python, Go, C++ or another modern programming language.\nExperience developing, debugging, and performance tuning highly concurrent systems.\nExpertise working with thoughtfully designed Restful APIs and influencing API design choices.\nMastery of test driven development, developing different levels of automated tests, such as unit test, functional test, and integration test.\nExcellent problem solving, collaboration and communication skills, both verbal and written.\n\nWhat We Offer You:\n\nA constant stream of new things for you to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies.\nA set of exceptionally talented and dedicated peers, from engineering and QA to product management and customer support.\nGrowth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation.\nA stable, collaborative and supportive work environment.\nAn opportunity to see the positive impact of your work on real customers.\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "DevOps Engineer", "street": "Lotnicza 12", "country_code": "PL", "address_text": "Lotnicza 12, Wrocław", "marker_icon": "devops", "workplace_type": "remote", "company_name": "Nokia", "company_url": "http://nokiawroclaw.pl/en/", "company_size": "3000+", "experience_level": "mid", "id": "nokia-devops-engineer-e64ba401-8322-476e-8e5f-5043104ee5e8", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "Docker", "level": 3}, {"name": "Cloud", "level": 3}, {"name": "DevOps", "level": 3}], "remote": true, "multilocation": [{"city": "Katowice", "slug": "nokia-devops-engineer-db841089-bd03-49aa-88aa-d4999cbbbb15", "street": "Centrum"}, {"city": "Wrocław", "slug": "nokia-devops-engineer-e64ba401-8322-476e-8e5f-5043104ee5e8", "street": "Lotnicza 12"}, {"city": "Warszawa", "slug": "nokia-devops-engineer-4eb2ccaf-4bd3-49da-bcdc-2332821732f4", "street": "Centrum"}, {"city": "Kraków", "slug": "nokia-devops-engineer-b6ba4157-54c8-4ec8-823f-0e78c82d5891", "street": "Centrum"}, {"city": "Bydgoszcz", "slug": "nokia-devops-engineer-bd4f2a83-a85e-4126-a87a-67f2d7062126", "street": "Centrum"}, {"city": "Łódź", "slug": "nokia-devops-engineer-a6434ab9-6e18-43fd-9bc9-3d89ba702ab2", "street": "Centrum"}, {"city": "Gdańsk", "slug": "nokia-devops-engineer-9c27459e-ab0a-4a41-bcbf-c66a5d9a5c07", "street": "Centrum"}, {"city": "Szczecin", "slug": "nokia-devops-engineer-447cd082-15dc-43b2-8f24-c8c14cea0fc1", "street": "Centrum"}, {"city": "Lublin", "slug": "nokia-devops-engineer-3dd5d99f-6e61-4678-ba99-85d61c4f41ba", "street": "Centrum"}, {"city": "Poznań", "slug": "nokia-devops-engineer-c62c15db-97a0-4dd2-bf37-94cd6bcd661a", "street": "Centrum"}], "description": "Come create the technology that helps the world act together\nNokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. \nWe challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work.\n\nThe team you’ll be part of\nAre you looking for new possibilities?\nWe are currently the largest institution of research and development in the ICT sector in Poland, successively growing and still looking for new talents. DevOps Specialist is one of the key positions in R&D Centers in Poland and at present, there are a few slightly different departments possibly interested in your experience. Find out which specific departments are currently recruiting for this position: Check our DevOps hiring teams\nBelow you will find some general information about our expectations in the DevOps Specialist positions.\n\nWhat you will learn and contribute to\nMaintenance of existing keys infrastructure\nPlanning, reviewing and cloud deployment of new and existing projects\nMonitoring current resource utilization and planning future needs\nMonitoring of existing production deployments, debugging issues, providing hot fixes\nCreation of tools to setup development environments \n\nYour skills and experience\nGood command of English language\nKnowledge scripting languages (Bash, Python)\nKnowledge of containers (Docker, LXC) and container orchestrators (Kubernetes)\nKnowledge of version control system git\nHands on experience with linux network stack\nExperience with CI/CD systems\nInfrastructure as a code familiarity\nAre you looking for more challenging position and already have hands-on experience with DevOps? Go to our offer for Senior DevOps Specialist.\n\nWhat we offer\nNokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs, and highly diverse teams with an inclusive culture where people thrive and are empowered.\n\nNokia is committed to inclusion and is an equal opportunity employer\nNokia has received the following recognitions for its commitment to inclusion & equality:\nOne of the World’s Most Ethical Companies by Ethisphere\nGender-Equality Index by Bloomberg\nWorkplace Pride Global Benchmark\nLGBT+ equality & best place to work by HRC Foundation\n At Nokia, we act inclusively and respect the uniqueness of people.\nNokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\nWe are committed to a culture of inclusion built upon our core value of respect.\n\nJoin us and be part of a company where you will feel included and empowered to succeed.\nInformujemy, że administratorem danych jest Nokia Solutions and Networks Sp. z o.o. z siedzibą w Warszawie, ul. Rodziny Hiszpańskich 8 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia ... more"}, {"title": "Senior Software Engineer (Golang)", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "go", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-senior-software-engineer-golang", "employment_types": [{"type": "permanent", "salary": {"from": 18000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "Kubernetes", "level": 4}, {"name": "AWS", "level": 5}, {"name": "Go", "level": 5}], "remote": false, "multilocation": [{"city": "Kraków", "slug": "splunk-senior-software-engineer-golang-krakow", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-senior-software-engineer-golang", "street": "Długa"}], "description": "Join us as we pursue our disruptive new vision to make machine data accessible, usable, and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun, and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\n\n\nAre you passionate about building software that makes a difference? Do you enjoy collaboration with a team of fun and smart creative people? Do you value an environment where you're empowered to make key technical decisions across a full stack of technologies? If so, a role on Splunk on Kubernetes (sok8s) team might be a great fit for you.\n\n\nRole\n\n\nAs a Senior Software Engineer you'll be part of Splunk’s core cloud platform and responsible for designing and developing Kubernetes based service to manage the lifecycle of cloud connected applications in Splunk cloud and customer managed environments. You will be immersed in both microservices and core platforms as well as have exposure to the full portfolio of technology areas.\n\n\nYou are an expert in distributed computing, cloud native software architecture/development and efficient in-memory algorithms. Initiative, passion and commitment is your soft currency. You are excited to take on roles that provide new growth and learning opportunities. Finally, you enjoy working with highly collaborative teams and have fun doing your stuff!\n\n\nWhat You’ll Do\n\nDesign and develop algorithms/code for Splunk Enterprise roadmap for Cloud.\nCollaborate in a CI / CD development model for cloud native deployments.\nCreate high quality distributed design and code and maintain it in the cloud.\nAnalyze and improve performance, scalability and reliability.\nBrainstorm and influence technical decision making for features and architecture turns.\nHave fun and achieve your career goals.\n\nRequirements\n\n8 years of related experience with a technical Bachelor’s degree; or equivalent practical experience;\nFamiliarity with working on Kubernetes Operator model, and Kubernetes APIs\nFamiliarity and experience with Microservices Architecture & AWS\nExpert level experience building cloud microservices and distributed systems in golang.\nDemonstrable foundation in data structures, algorithms and software design for cloud scale.\nExperience with agile development models for cloud native architectures (Microservices, automated CICD, RESTful API’s SOA, etc) at cloud scale.\nPrior development experience in networking protocol stacks (TCP/IP, HTTPx, DNS).\nFamiliarity and prior experience working with Kubernetes, dockers and AWS/GCP.\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\n\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Security Architect", "street": "Rondo Daszyńskiego 2B", "country_code": "PL", "address_text": "Rondo Daszyńskiego 2B, Warszawa", "marker_icon": "security", "workplace_type": "remote", "company_name": "Standard Chartered GBS Sp. z o.o.", "company_url": "https://www.sc.com/pl/", "company_size": "+1000", "experience_level": "mid", "id": "standard-chartered-gbs-sp-z-o-o-security-architect-warszawa", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "Java", "level": 2}, {"name": "Security", "level": 3}, {"name": "AWS", "level": 3}], "remote": true, "multilocation": [{"city": "Warszawa", "street": "Rondo Daszyńskiego 2B", "slug": "standard-chartered-gbs-sp-z-o-o-security-architect-warszawa"}], "description": "Security Architect\n\n\nTHE ROLE RESPONSIBILIETIES:\nBecome a trusted advisor and subject matter expert (SME) on security architecture. provide deep architectural expertise on complex cloud and on-premises projects,  \nDeliver workable risk/threat-driven solutions with cost/benefit analysis. \nCommunicate with both technical and non-technical stakeholders, provide guidance on proper architectural patterns. Identify and mitigate anti-patterns, redundancies, and duplications.  \nPerform gap analysis for specific domains, identify gaps in existing capabilities, service maturity.  \nIdentify missing cybersecurity and cyber-resilience capabilities in alignment with changing business needs, threat land scape and technical requirements to increase the quality of the selected solutions also including topics such as products’ convergence over time and products decommissioning. \nDefine and manage architecture artefacts including reference architecture documents, blueprints, technical and non-technical security requirements aligned to the corresponding strategic roadmap. \nAligns architecture principles with our cybersecurity strategy, ensures alignment to roadmaps, cyber security, and resiliency standards as well as to our architectural framework.  \nResponsible for security architectural design, realisation of the architecture in the solution implementation roadmap. \nAnalyse market trends and threat landscape, provide meaningful insights, opportunities, and risks. \nRepresent the architecture group in key internal service architecture governance forums.  \nWork closely with your pears in the security architecture group, service and solution architects, engineers, project teams. \n\nOUR IDEAL CANDIDATE:\nBachelor's degree in engineering, computer science, preferably majoring in cybersecurity.    \n3 and more years of experience in security architecture roles, leading complex architectural projects with multiple stakeholders, utilizing various security tools/technologies. \n2-3 years hands-on experience (coding in Java, JS, Python) ideally full stack development.\nProven threat modelling experience using STRIDE/MITRE/OWASP and/or other threat modelling methodologies for complex systems (ideally MITRE ATT&CK Defenders (MAD) Certified). \n1-2 years of experience in networking architecture and/or networking security architecture and/or AWS networking specialty certified / Cisco CCNP Security / etc. \nDeep technical skills with good understanding in cross-functional technologies (IAM, data protection, threat management, vuln management, etc.) ability to dive into technical engineering details. \nExperience in offensive tactics, techniques, and procedures (TTPs), pen-testing / hacking background or (OSCP, CEH master) certified. \nExcellent communication skills, ability to explain complex topics to both technical and non-technical audiences. Proven ability to influence relevant stakeholders and decision makers. \nExcellent organisational skills, ability to manage deadlines and effectively prioritise multiple projects.\n\nRole Specific Technical Competencies:\nExperience working in security architecture / engineering roles for financial institutes.\nRelevant cybersecurity certifications (AWS/Google/Microsoft Certified Security specialist, architect, GDSA, SANS GIAC, CISSP-ISSAP).\nAWS solutions architect professional certified and 3 years of experience in AWS environment or 5 hands-on years equivalent experience in AWS solution architecture.\nIn depth understanding of threat-attack methodologies (STRIDE, DREAD, OWASP, Attack trees, MITRE ATT&CK, etc.) and corresponding mitigations in an enterprise environment.\nExperience with cybersecurity frameworks e.g., NIST cybersecurity framework, NIST 800-53v5, NIST 800-37, ISO 27xxx, etc.\nKnowledge of offensive tactics, techniques, and procedures (TTPs), ideally completed training and/or certifications (OSCP, CEH, Pentest+, etc.)\n\nYOU WILL BE OFFERED:\nCareer development in a fast-growing company with a clear business strategy\nOpportunity to expand international experience and build global professional relations\nCompetitive benefits package (incl. health & life insurance, pension plan, meal & sports cards)\n3 days of paid volunteering leave our employees can use to support the cause of their choice\nConvenient location (next to Rondo Daszyńskiego) with subway, tram and bus lines and comfortable office space with chillout areas, free coffee/tea & fruit supply\n26 days of leave per year for all the employees\n\nAbout Standard Chartered \nWe're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If you're looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we can't wait to see the talents you can bring us.\n\nOur purpose, to drive commerce and prosperity through our unique diversity,  together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, you'll see how we value difference and advocate inclusion. Together we:\nDo the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\nNever settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so well\nBe better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long term\n\nRecruitment assessments - some of our roles use assessments to help us understand how suitable you are for the role you've applied to. If you are invited to take an assessment, this is great news. It means your application has progressed to an important stage of our recruitment process.\n\n\nInformujemy, że administratorem danych jest Standard Chartered GBS Sp. z o.o. z siedzibą w Warszawie, ul. Rondo Daszyńskiego 2B (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych... more"}, {"title": "Senior Engineering Manager - Teleport", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "devops", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-senior-engineering-manager-teleport", "employment_types": [{"type": "permanent", "salary": {"from": 27000, "to": 33000, "currency": "pln"}}], "skills": [{"name": "Docker", "level": 1}, {"name": "Terraform", "level": 1}, {"name": "AWS", "level": 5}], "remote": false, "multilocation": [{"city": "Tarnów", "slug": "splunk-senior-engineering-manager-teleport-tarnow", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-senior-engineering-manager-teleport", "street": "Długa"}, {"city": "Katowice", "slug": "splunk-senior-engineering-manager-teleport-katowice", "street": "Centrum"}], "description": "Join us as we pursue our exciting vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and strive to provide the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun, and to each other’s success. Learn more about Splunk careers and how you can join our journey.\n\n\nThis Senior Manager for Engineering will lead critical services within our Platform umbrella. Success will be measured by your ability to build and lead your team as part of our overall engineering strategy. You will seamlessly integrate within our innovative culture and contribute to our excellent record for delivering market leading solutions. You are a seasoned leader with a demonstrated history building and leading both established and emerging engineering talent, while fostering an environment of inclusion, creativity, and innovation.\n\n\nOur team is a dynamic technology group with a mission to make data accessible, usable and valuable to everyone. If you possess a passion for outstanding technology leadership and embrace the challenge of working on highly scalable systems that handle large volumes of data, this position is for you. We are building state-of-the-art capabilities, data processing and search systems, support tools, security frameworks and automation instrumentation that will greatly impact how our customers successfully use data to improve their businesses performance, scalability, profitability, and market strategies.\n\n\nWe are looking for a proven, seasoned engineering leader to lead key elements of our customer data onboarding systems. You will build and lead an elite team of engineers who will be working on systems that will power the next generation of Splunk and enable ever deeper customer insights.\n\n\nIn this role, you will:\n\nHire and develop an engineering team, focused on making our industry leading technology even more valuable to our customers.\nDiagnose and resolve systemic obstacles that prevent your team from delivering high-quality software.\nChampion an atmosphere of continuous improvement by serving as a coach, mentor, and technical advisor.\nPlan and support career development.\nRecruit and retain top talent.\nBe an advocate of scalable and extensible, recoverable, manageable architecture for Core products and services.\n\nIdeal Experience\n\nExperience leading engineering teams working on large scale data pipelines, CI/CD infrastructure and processing systems\nExperience hiring and cultivating teams.\nExperience developing new products and infrastructure, either in small companies or within the context of larger organizations. A mix of start-up and bigger company experience is a plus.\nExperience working within geographically distributed organizations.\nExperience building and cultivating strong engineering practices and processes.\nConsistent track record of delivering scalable, high performance, and high quality software systems.\nBroad understanding of various cloud development technologies and industry trends for enterprise-scale, distributed systems.\nStrong technical acumen, creativity, interpersonal skills, and emotional intelligence.\n\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "C++ Developer", "street": "Lotnicza 12", "country_code": "PL", "address_text": "Lotnicza 12, Wrocław", "marker_icon": "c", "workplace_type": "remote", "company_name": "Nokia", "company_url": "http://nokiawroclaw.pl/en/", "company_size": "3000+", "experience_level": "mid", "id": "nokia-c-developer-6b381b65-9260-450a-b544-8940bc0f6bc8", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "GCC", "level": 2}, {"name": "C++ Embedded", "level": 2}, {"name": "C++", "level": 4}], "remote": true, "multilocation": [{"city": "Gdańsk", "slug": "nokia-c-developer-6de7dfb3-0326-47dd-9b0c-464355085814", "street": "Centrum"}, {"city": "Łódź", "slug": "nokia-c-developer-f117e055-dd57-40bc-a0d9-13c92e758e86", "street": "Centrum"}, {"city": "Poznań", "slug": "nokia-c-developer-17834389-50f9-4c1b-9567-a429a943c35e", "street": "Centrum"}, {"city": "Szczecin", "slug": "nokia-c-developer-40267685-2d09-495d-8e87-fc924aa97a3f", "street": "Centrum"}, {"city": "Lublin", "slug": "nokia-c-developer-5d657693-e5cd-42c7-be2a-d9624b16ca2e", "street": "Centrum"}, {"city": "Kraków", "slug": "nokia-c-developer-aad3c5e9-f40f-4d21-93b9-b9c2cc082b66", "street": "Centrum"}, {"city": "Wrocław", "slug": "nokia-c-developer-6b381b65-9260-450a-b544-8940bc0f6bc8", "street": "Lotnicza 12"}, {"city": "Warszawa", "slug": "nokia-c-developer-4e0f27ef-7696-40e6-ba6d-cc84f428467d", "street": "Centrum"}, {"city": "Bydgoszcz", "slug": "nokia-c-developer-d992a093-d2e0-451c-acb6-b49354a551a6", "street": "Centrum"}, {"city": "Katowice", "slug": "nokia-c-developer-9e907d7d-4171-4539-886e-ae826712dab2", "street": "Centrum"}], "description": "Come create the technology that helps the world act together\nNokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. \nWe challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work.\n\nAre you ready to start your adventure with Nokia?\nWe are currently the largest institution of research and development in the ICT sector in Poland, successively growing and still looking for new talents. C++ Developer is one of the key positions in R&D Centers in Poland and at present, there are a few slightly different departments possibly interested in your experience. Apply today and help us to build the fastest 5G technology that connects the world.\n\nWhat you will learn and contribute to\nDeveloping, and implementing software utilizing the latest software best practices\nAnalyzing and solving complex engineering problems and hitches in radio technologies area\nOccasional participation in creating and reviewing requirements for functional, design and interface specifications based on system and HW specifications\nCooperation with project managers in planning activities\n Your skills and experience\nYou have:\nCommercial experience with C++ \nExpertise in algorithm optimization, code profiling and in analysis of memory usage violations\nAnalytical and problem-solving skills\nKnowledge of Boost and STL C++ libraries\nGood communication in English (both written and spoken)\n\nIt would be nice if you also had:\nPython/Bash is an advantage\nFamiliarity with 5G, LTE, 3G and 3GPP\nExperience with C++ embedded\n\nTechnologies we work with:\nC++11/14/17\nGCC, Clang\nLinux\nTesting frameworks\nJIRA\nVersion control and code review systems (Git/Gerrit)\nContinuous Integration systems\n\nWhat we offer\nNokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n\nNokia is committed to inclusion and is an equal opportunity employer\nNokia has received the following recognitions for its commitment to inclusion & equality:\nOne of the World’s Most Ethical Companies by Ethisphere\nGender-Equality Index by Bloomberg\nWorkplace Pride Global Benchmark\nLGBT+ equality & best place to work by HRC Foundation\n\nAt Nokia, we act inclusively and respect the uniqueness of people.\nNokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\nWe are committed to a culture of inclusion built upon our core value of respect.\n\nJoin us and be part of a company where you will feel included and empowered to succeed.\n\n\nAdditional:\nAre you still looking for your first experience? Do you have an active student status and are looking for job that you can combine with your studies? Check our offer for Working Student.\nOr maybe you are looking for more challenging position and already have hands-on experience with software development? Go to our offer for Senior C++ Developer.\nInformujemy, że administratorem danych jest Nokia Solutions and Networks Sp. z o.o. z siedzibą w Warszawie, ul. Rodziny Hiszpańskich 8 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia ... more"}, {"title": "Senior Software Engineer", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "python", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-senior-software-engineer", "employment_types": [{"type": "permanent", "salary": {"from": 18000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "AWS", "level": 5}, {"name": "Python", "level": 5}, {"name": "Go", "level": 5}], "remote": false, "multilocation": [{"city": "Kraków", "slug": "splunk-senior-software-engineer", "street": "Długa"}, {"city": "Katowice", "slug": "splunk-senior-software-engineer-katowice", "street": "Centrum"}, {"city": "Tarnów", "slug": "splunk-senior-software-engineer-tarnow", "street": "Centrum"}], "description": "As an Engineer on Developer Experience Team, you will be at the heart of Splunk’s engineering process building software that empowers engineering teams to develop and deliver high quality products quickly. We are focused on solving the hardest, most interesting challenges of developing and testing software at scale without sacrificing stability, quality, velocity or code health. We ensure Splunk’s success by partnering with engineering teams and developing scalable tools and providing scalable infrastructure that help engineers develop, test, debug and release software quickly. We impact Splunk Engineers and our customers by increasing the pace of product development and ensuring our products are shipped with quality. We are looking for candidates who share a passion for building scalable and robust. Frameworks and services for our CI/CD pipeline which enable and help developers deliver quality software to customers quickly. \n\nAs a Senior Software Engineer on the Developer Experience Team you will\n\nCreate frameworks and services that will improve developer velocity and productivity.\nDevelop a paved road for code validation tools and services to help shift left the testing of the product.\nCreate and maintain a developer portal that is a highly extensible platform powered by a service catalog.\nDrive adoption of best practices in code health, development productivity, and maintainability.\nEnable Observability and Insights for helping improve Developer Productivity.\nOwn features from start to finish; Mentor junior engineers.\n\n\nRequirements\n\nStrong fundamentals in software engineering: data structures and algorithms\nExperience working with CI/CD tools and pipelines (Gitlab, Github Actions)\nCoding proficiency in one or more of the following languages with the ability to quickly learn new languages: Go, Python.\nKnowledge of typescript/javascript is a plus.\nExperience/Familiarity  with test automation frameworks, code coverage, SAST tools. \nKubernetes/Docker experience.\nObservability/Opentelemetry is a plus.\nStrong debugging and troubleshooting skills including the use of associated tools\nKnowledge of any one of the public cloud services like AWS, GCP, Azure \n\n\nWhat we offer\n\nA team of incredibly capable and dedicated peers, all the way from engineering to product management and customer support.\nA stable, collaborative, and supportive work environment. We work in an open environment, work together to get things done, and adapt to the changing needs for the team. We keep it real by being open and honest. \nBalance. We want you to be successful outside of work too. We trust our colleagues to be responsible with their time and commitment, and believe that balance helps cultivate a positive environment.\nFun. We are committed to having every employee want to give it their all, be respectful and a part of the family, and have a smile on their face while doing it.\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\n\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Senior Software Engineer Python", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "python", "workplace_type": "partly_remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-senior-software-engineer-python-krakow", "employment_types": [{"type": "permanent", "salary": {"from": 18000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "AWS", "level": 5}, {"name": "Python", "level": 5}], "remote": false, "multilocation": [{"city": "Wieliczka", "slug": "splunk-senior-software-engineer-python-2c4a5b23-38bf-4e50-a649-aaf80a4a527f", "street": "Centrum"}, {"city": "Kraków", "slug": "splunk-senior-software-engineer-python-krakow", "street": "Długa"}, {"city": "Tarnów", "slug": "splunk-senior-software-engineer-python-tarnow", "street": "Centrum"}, {"city": "Katowice", "slug": "splunk-senior-software-engineer-python-katowice", "street": "Centrum"}], "description": "Join us as we pursue our innovative vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, our customers, having fun and most meaningfully, to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\n\n\n\nAre you passionate about working on critical systems to create tangible customer impact? Would you like the opportunity to work at a growing company that is changing the way that information is used to support business decisions? If this resonates with you, we would love to speak with you.\n\n\n\nOur team is a dynamic technology group with a mission to make data accessible, usable and valuable to everyone. If you possess a passion for outstanding technology leadership and embrace the challenge of working on highly scalable systems that handle large volumes of data, this position is for you. We are building state-of-the art capabilities, data processing and search systems, support tools, security frameworks and automation instrumentation that will greatly impact how our customers successfully use data to improve their businesses performance, scalability, profitability, and market strategies.\n\n\n\nRole\n\nParticipate in the complete software development cycle: Understand requirements, design, develop, test, automate and deploy software\nIdentify and resolve pre-production system bottlenecks and production issues\nEngage in design and code reviews of the product, and enhance your knowledge of customers’ experiences to prevent future problems\nMake code maintainable and the product diagnosable and serviceable\nParticipate in rotating on-call duties to diagnose and solve customer issues.\nOwn features from start to finish; Mentor junior engineers\n\n\nRequirements\n\nStrong fundamentals in software engineering: data structures and algorithms\nCoding proficiency in one or more of the following languages with the ability to quickly learn new languages: Python (preferred), Java, Go or C++\nExperience in working on distributed systems like databases, distributed file systems, distributed concurrency control, consistency models, CAP theorem is an added plus.\nStrong debugging and troubleshooting skills including the use of associated tools\nExperience with developing CI/CD systems, test automation frameworks, \nAbility to document your work for the benefit of the team\nKnowledge of REST, grpc or similar communication paradigms\nKnowledge of public cloud services such as AWS, GCP, Azure \nOperational excellence: you think beyond feature delivery into how your code is serving customers in production\n\n\nWhat we offer\n\nA team of incredibly capable and dedicated peers, all the way from engineering to product management and customer support.\nA stable, collaborative, and supportive work environment. We work in an open environment, work together to get things done, and adapt to the changing needs for the team. We keep it real by being open and honest. \nBalance. We want you to be successful outside of work too. We trust our colleagues to be responsible with their time and commitment, and believe that balance helps cultivate a positive environment.\nFun. We are committed to having every employee want to give it their all, be respectful and a part of the family, and have a smile on their face while doing it.\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\n\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "PHP developer (100% zdalnie)", "street": "Centrum", "country_code": "PL", "address_text": "Centrum, Wrocław", "marker_icon": "php", "workplace_type": "remote", "company_name": "Brand Technology", "company_url": "https://brandtechnology.pl", "company_size": "10-15", "experience_level": "mid", "id": "brand-technology-php-developer-100-zdalnie-wroclaw", "employment_types": [{"type": "b2b", "salary": {"from": 8000, "to": 12800, "currency": "pln"}}], "skills": [{"name": "MySQL", "level": 3}, {"name": "PHP", "level": 4}, {"name": "Symfony / Laravel", "level": 4}], "remote": true, "multilocation": [{"city": "Wrocław", "slug": "brand-technology-php-developer-100-zdalnie-wroclaw", "street": "Centrum"}, {"city": "Gdańsk", "slug": "brand-technology-php-developer-100-zdalnie-gdansk", "street": "Centrum"}, {"city": "Olsztyn", "slug": "brand-technology-php-developer-100-zdalnie-5d89ebf2-5415-40c2-9132-6711e964518f", "street": "Centrum"}, {"city": "Warszawa", "slug": "brand-technology-php-developer-100-zdalnie-266cd813-c653-4922-8738-20c1cf55834b", "street": "Centrum"}], "description": "Poszukujemy kolejnych programistów do naszego zespołu do pracy nad naszymi projektami.\n\nO nas\nPracujemy głównie nad aplikacjami typu systemy finansowe, ERP/CRM, API oraz platformy typu SaaS.\nStale rozwijamy kilka projektów, np. System Obsługi Najmu - kod który napiszesz będzie używany przez setki agencji oraz kilkadziesiąt tysięcy najemców!\nRealizujemy też inne ciekawe projekty przy których będziesz mógł się rozwijać a szczegółowe code review pozwoli Ci się szybciej zdobywać doświadczenie 🚀🚀🚀\nNie robimy wizytówek / wordpress / itp\nKładziemy nacisk na wysoką jakość kodu, co przekłada się na wysoką jakość naszych projektów a także zapewnia nam porządek i czystą architekturę\nOpieramy się na zaufaniu i szacunku - do siebie oraz klientów - i takich osób szukamy\nCEO jest developerem więc zna problemy i potrzeby innych developerów 🙂\n\nNasza metodologia pracy\nGit\nBitBucket\nJIRA\nFlock\nWIKI / Confluence\nCode Review\nTester w zespole\nTesty integracyjne\nTechnologie stosowane w zależności od projektów - jednak już w PHP8+\n\nWymagania\nCo najmniej dwuletnie doświadczenie w pracy z frameworkiem Laravel (ew. Symfony)\nBardzo dobra znajomość PHP 7+\nDobra znajomość baz danych MySQL oraz zasad projektowania relacyjnych baz danych\nZnajomość systemu kontroli wersji GIT\nZnajomość języka angielskiego w stopniu umożliwiającym czytanie dokumentacji\nSamodzielność i odpowiedzialność\n\nMile widziane\nZnajomość Dockera\nZnajomość Vue.js\nUmiejętność organizacji pracy\n\nOferujemy\nWynagrodzenie do 12 800 netto na B2B\nTerminowe płatności\nPremie / bony na święta\nPracę w pełni zdalną - wystarczy, że masz dostęp do internetu\nCałkowicie elastyczne godziny pracy - (jednak minimum 100 godzin miesięcznie)\nBrak biurokracji - praca w luźnej atmosferze bez napiętych terminów\n\nKandydatury nie spełniające powyższych wymagań nie będą rozpatrywane.\n\n❗️Bardzo szybki proces rekrutacji - możemy rozpocząć współpracę w ciągu jednego tygodnia ❗️\n\n\nProces rekrutacji\nCzekamy na zgłoszenie\nJeśli uznamy, że pasowałbyś do naszego zespołu, w ciągu jednego tygodnia odpowiadamy na Twoje zgłoszenie z dodatkowymi pytaniami\nJeśli odpowiedzi/warunki będą dla nas zadowalające, w ciągu kilku dni odpowiadamy i umawiamy się na rozmowę\nRozmowa zajmie ok. 30 min , po zakończeniu wysyłamy zadania testowe do realizacji\nMaksymalnie w ciągu jednego tygodnia podejmujemy decyzję o współpracy (lub nie - wówczas również dajemy znać)\nJeśli mamy dogadane wszystkie szczegóły - podpisujemy umowę 🤝\nInformujemy, że administratorem danych jest Brand Technology Paweł Czartoryski z siedzibą w Olsztynie, ul. Polna 1A/5 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wnies... more"}, {"title": "Wordpress Frontend Developer", "street": "PPNT", "country_code": "PL", "address_text": "PPNT, Gdynia", "marker_icon": "html", "workplace_type": "remote", "company_name": "Tamago", "company_url": "https://www.tamago.software/", "company_size": "25", "experience_level": "mid", "id": "tamago-wordpress-frontend-developer-28135118-7b09-4f90-bcb7-8fe0c1063c60", "employment_types": [{"type": "b2b", "salary": {"from": 6000, "to": 10000, "currency": "pln"}}], "skills": [{"name": "HTML", "level": 3}, {"name": "ACF", "level": 3}, {"name": "WooCommerce", "level": 3}], "remote": true, "multilocation": [{"city": "Kraków", "slug": "tamago-wordpress-frontend-developer-krakow", "street": "Centrum"}, {"city": "Gdańsk", "slug": "tamago-wordpress-frontend-developer-gdansk", "street": "Centrum"}, {"city": "Warszawa", "slug": "tamago-wordpress-frontend-developer-563da5d9-cf69-41b4-ae6c-20f1d4b3a831", "street": "Centrum"}, {"city": "Wrocław", "slug": "tamago-wordpress-frontend-developer-ab45efd7-04c6-43eb-8015-f46c6dd86c32", "street": "Centrum"}, {"city": "Gdynia", "slug": "tamago-wordpress-frontend-developer-28135118-7b09-4f90-bcb7-8fe0c1063c60", "street": "PPNT"}], "description": "Cześć!\nJesteśmy Software Housem wywodzącym się z Agencji Digital marketingu. \n\nPływamy obecnie po trójmiejskim, bezpiecznym morzu, ale powoli zapuszczamy się na dalsze nieznane wody. Do naszego Zespołu szukamy Wordpress Frontend Developera.\n\nSzybko rośniemy i chcemy budować zespół, w którym dzielimy się wiedzą i śmiało mówimy o swoich potrzebach i nowych pomysłach. Zależy nam, żeby móc na sobie polegać i razem podbijać cyfrowy świat.\n\nPraca zdalna. Pracujemy na ClickUpie. Do codziennej komunikacji używamy Discorda. Oczekujemy samodzielności, umiejętności rozwiązywania problemów, szukania jak najbardziej optymalnego rozwiązania. \n\nUmiejętności:\n\numiejętność tworzenia motywów na Wordpress w oparciu o otrzymany layout. Podstawowa wiedza z zakresu php oraz sql\numiejętność korzystania z Figmy\nznajomość Woocommerce i umiejętność tworzenia autorskich motywów z wykorzystaniem Woocommerce\nznajomość technologii HTML5, CSS3, AJAX, jQuery\numiejętność tworzenia stron na urządzenia mobilne korzystając z techniki Responsive Web Design (RWD),\nkorzystanie z systemu kontroli wersji GIT,\nznajomość ACF,\nznajomość motywu Sage 10 wraz z użyciem components oraz composers \nznajomość biblioteki Sage RAcorn,\nznajomość biblioteki ACF Composer,\nznajomość tailwind \nsamodzielność, terminowość i odpowiedzialność za zadania\n Informujemy, że administratorem danych jest Tamago Software sp. z o.o. z siedzibą w Sopocie, ul.Armii Krajowej 116/15 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wnies... more"}, {"title": "Engineering Team Lead (Offer&Hire Team)", "street": "Fabryczna 20A", "country_code": "PL", "address_text": "Fabryczna 20A, Kraków", "marker_icon": "java", "workplace_type": "remote", "company_name": "SmartRecruiters Inc.", "company_url": "https://www.smartrecruiters.com/", "company_size": "450", "experience_level": "senior", "id": "smartrecruiters-inc-engineering-team-lead-offer-hire-team", "employment_types": [{"type": "b2b", "salary": {"from": 24500, "to": 31500, "currency": "pln"}}, {"type": "permanent", "salary": {"from": 21000, "to": 28000, "currency": "pln"}}], "skills": [{"name": "Java", "level": 4}, {"name": "Microservice Architecture", "level": 4}], "remote": true, "multilocation": [{"city": "Warszawa", "slug": "smartrecruiters-inc-engineering-team-lead-offer-hire-team-warszawa", "street": "-"}, {"city": "Wrocław", "slug": "smartrecruiters-inc-engineering-team-lead-offer-hire-team-wroclaw", "street": "-"}, {"city": "Kraków", "slug": "smartrecruiters-inc-engineering-team-lead-offer-hire-team", "street": "Fabryczna 20A"}, {"city": "Poznań", "slug": "smartrecruiters-inc-engineering-team-lead-offer-hire-team-poznan", "street": "-"}], "description": "🚀 SmartRecruiters is building an operating system (SaaS product hosted on AWS and GCP) for recruiting and is on a mission to connect people with jobs at scale. The company is growing quickly and recently hit the 1.5 billion dollar valuation. The system is used by over 4,000 companies, including employees at LinkedIn, McDonald's, CD Bosch, Allegro, and many more! Our engineering team solves one of the most important problems of the modern economy - connecting great people with great jobs. We supported over 100M job seekers to date! 💪 🚀 \n\nOur system is composed of hundreds of independent services (each sitting on Docker, orchestrated by Kubernetes). We build most of our services in Java and do over 2000 production deployments per month, maintaining an uptime of 99.98. We are looking for an Engineering Team Lead to help us build the next chapter of that vision. \n\n🚀 Our engineering organization is built with small, cross-functional teams where Engineers, Product Managers, and Product Designers work side by side to solve customer problems. Each team owns a part of our business and takes care of it, from feature ideas to usage analysis.\n\nOffer & Hire Team believes every organization should be able to allow their applicants to safely control data consent, be able to engage their candidates with a smooth offering experience, and be able to ensure their candidates' hire is efficiently administered.\n\nWe are looking for an experienced engineer that would like to grow as a people leader. Engineering Team Leads at SmartRecruiters spend around 50% of their time managing people and collaborating with stakeholders and 50% of their time designing and building products. Team Leads represent their teams externally, help others grow, and ensure the team's discovery and delivery work runs smoothly. \n\nYou may be located anywhere in Poland and work remotely or out of our Cracow office!\n\nWhat will you do:\n\nCollaborate with Product Managers and Product Designers on building the next-generation product\nOversee roadmap discovery and delivery\nTake ownership of the designated services\nDrive engineering excellence inside the team\nMentor and coach other engineers\nContribute to the full life-cycle of the product (including problem discovery, prototyping, design, implementation, and measuring adoption)\nBuild services with Java / Node.js (Express, Nest.js) / Angular - depending on your background (frontend/backend)\n\nQualifications\n\nExperience in designing, developing, and operating distributed web-based systems\nExperience in supporting end-to-end product lifecycle (from product discovery, solutioning, system design, implementation, production rollout, and optimization)\nPassion for supporting team members in their career growth\nExcellent technical project management and communication skills\nGood understanding of agile processes and techniques\nGood command of one of the programming languages like Java, Javascript or Kotlin\nStrong domain modeling skills - including refactoring existing domains\nStrong command of the English language, both written and verbal\n\nBenefits:\n\nWe support 100% remote work with Wi-Fi reimbursement and an additional stipend for the equipment (the MacBook laptop is provided by us)\nUnlimited vacation days (yes - it's really unlimited)\nPrivate Medical Care for you and your dependents (Luxmed)\nCompany equity plan \nWellness Programme (Multisport Card and even more)\n26 fully paid vacation days during each calendar year (B2B)\n\nAdditional information\nSmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\nInformujemy, że administratorem danych jest SmartRecruiters Inc. z siedzibą w Krakowie, ul. Fabryczna 20A (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi... more"}, {"title": "Senior Python Developer (Analytics)", "street": "Wadowicka 6", "country_code": "PL", "address_text": "Wadowicka 6, Kraków", "marker_icon": "python", "workplace_type": "remote", "company_name": "Aterian", "company_url": "https://www.aterian.io/", "company_size": "200", "experience_level": "senior", "id": "aterian-senior-python-developer-analytics-146e1bff-5246-4162-973f-130dff553a86", "employment_types": [{"type": "b2b", "salary": {"from": 4000, "to": 6700, "currency": "usd"}}], "skills": [{"name": "Spark", "level": 1}, {"name": "Python", "level": 4}], "remote": true, "multilocation": [{"city": "Warszawa", "slug": "aterian-senior-python-developer-analytics-40eeddb7-004b-4026-9e8b-27fb632ed59a", "street": "centrum"}, {"city": "Poznań", "slug": "aterian-senior-python-developer-analytics-b458d7b8-a7b6-4c67-b059-547919ab0734", "street": "centrum"}, {"city": "Kraków", "slug": "aterian-senior-python-developer-analytics-146e1bff-5246-4162-973f-130dff553a86", "street": "Wadowicka 6"}], "description": "Aterian (NASDAQ: ATER) is a rapidly growing technology-enabled consumer products company that uses machine learning, natural language processing, and data analytics to design, develop, market, and sell products through online retail channels (e.g., Amazon, Walmart, etc). Aterian was founded on the premise that if a company selling consumer packaged goods was founded today, it would apply artificial intelligence and machine learning, the synthesis of massive quantities of data, and the use of social proof to validate high caliber product offerings as opposed to over-reliance on brand value and other traditional marketing tactics.\n\nAbout our project:\nAs a member of the Aterian team, you will be working on one of our proprietary products. We sell on various e-commerce platforms, including being one of the largest sellers on Amazon, and our system for managing sales channels is automated, offering services such as fulfillment and logistics, forecasting demand, optimizing marketing, pricing and market research, as well as utilizing affiliate platforms.\n To achieve all this, we need team members ready to dive in and help us grow. That’s where you come in.\n  What we use (you don’t need to know everything on the list, but it helps):\n⦿ Python\n⦿ PostgreSQL, Elasticsearch, Spark, Redis\n⦿ Github, Jira, Azure\n⦿ Linux\n\nWhat we need you to have:\n⦿ A minimum of 3-6 years of professional experience in developing production-grade systems using Python and Flask or similar technologies\n⦿ An understanding of analytics design patterns and data pipelines\n⦿ Proficiency in SQL\n⦿ Understanding of OOP concepts\n⦿ Experience in effectively communicating with stakeholders and translating business requirements into analytical code\n⦿ Proficiency in spoken and written English\n⦿ Experience in a big-data environment, with proficiency in developing against NoSQL databases such as ElasticSearch, MongoDB, and Cassandra is an added advantage\n⦿ Experience in building applications utilizing Apache Spark is an added advantage\n⦿ Experience in developing using .NET is an added advantage\n⦿ Experience in ReactJS/Frontend development is an added advantage.\n\nPersonality Traits we're chasing:\n⦿ Teacher - loves to share knowledge with the team, never stops learning new things\n⦿ Detail-oriented - pays attention to detail and is able to ensure high quality results\n⦿ Self-motivated - is able to motivate themselves and take initiative when needed\n⦿ Critical Thinker - takes a scientific approach to problems by questioning, identifying patterns and utilizing critical thinking to find solutions.\n\nWhat we're offering:\n⦿ Salary in range of 4000 USD - 6700 USD\n⦿ Macbook M1 Pro\n⦿ 4+ weeks of paid vacation (depends on performance)\n⦿ All your national or religious holidays are off work\n⦿ Paid sick leave\n⦿ Flexible working times\n⦿ 2000 USD per year as Education Budget (after first 6 months of work)\n⦿ Work fully remotely or from our office in Cracow\n\nRecruitment process:\nThere are 2 steps in our recruitment process. \nAfter reviewing and accepting your CV we'll invite you to two meetings:\n⦿ First Interview - 120 minutes long Google Meet call. We will discuss technical patterns, infrastructure, architecture, OOPs and also conduct a coding session with live performance optimization. You must be able to share your screen and be prepared to run some code.\n⦿ Second Interview - up to 30 minutes long Google Meet call. We will discuss your soft skills, check your team-fit and talk in English.\nWe don't like to stretch the process so expect those calls to be performed in a timespan of 48h each.\nInformujemy, że administratorem danych jest Aterian z siedzibą w Krakowie, ul. Wadowicka 6 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadz... more"}, {"title": "Analityk biznesowy", "street": "chłodna 51", "country_code": "PL", "address_text": "chłodna 51, Warszawa", "marker_icon": "analytics", "workplace_type": "remote", "company_name": "Bertek", "company_url": "http://www.bertek.eu", "company_size": "60", "experience_level": "mid", "id": "bertek-analityk-biznesowy", "employment_types": [{"type": "permanent", "salary": {"from": 14000, "to": 16000, "currency": "pln"}}], "skills": [{"name": "Angular", "level": 1}, {"name": "Java", "level": 1}], "remote": true, "multilocation": [{"city": "Warszawa", "slug": "bertek-analityk-biznesowy", "street": "chłodna 51"}, {"city": "Poznań", "slug": "bertek-analityk-biznesowy-poznan", "street": "Centrum"}, {"city": "Gdańsk", "slug": "bertek-analityk-biznesowy-gdansk", "street": "Centrum"}, {"city": "Kraków", "slug": "bertek-analityk-biznesowy-krakow", "street": "Centrum"}, {"city": "Wrocław", "slug": "bertek-analityk-biznesowy-wroclaw", "street": "Centrum"}], "description": "Nasz Klient - lider w cyfryzacji procesów biznesowych - rozbudowuje zespół analityczny a my pomagamy mu znaleźć ekspertów, gotowych na długofalową współpracę. Jeżeli poniższe zadania nie są dla Ciebie tylko rutyną ale i przyjemnością - aplikuj!\n\nAnalityk biznesowy\n\nZadania:\n- zbieranie i analiza wymagań klienta biznesowego związanych z budową i rozwojem rozwiązań IT\n- modelowanie procesów biznesowych (BPMN, UML)\n- optymalizacja procesów biznesowych (rekomendacje)\n- przygotowywanie dokumentacji analitycznej i specyfikacji systemów \n- wsparcie analityczne na etapach projektowania, wytwarzania i testowania systemów \n- ścisła współpraca z zespołem projektowym\n Oczekiwania:\n- doświadczenie w pracy na podobnym stanowisku\n- język polski, komunikatywna znajomość języka angielskiego\n- umiejętności analityczne i komunikacyjne\n- zrozumienie zagadnień technicznych na ogólnym poziomie\n- doświadczenie w zakresie dokumentowania wymagań zgodnie z przyjętymi standardami\n- umiejętność pracy z zespołem projektowym\nInformujemy, że administratorem danych jest Bertek z siedzibą w W-wie, ul. chłodna 51(dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczeg... more"}, {"title": "Release Engineer", "street": "Centrum", "country_code": "PL", "address_text": "Centrum, Wrocław", "marker_icon": "mobile", "workplace_type": "remote", "company_name": "SmartBear", "company_url": "https://smartbear.com/", "company_size": "850+", "experience_level": "junior", "id": "smartbear-release-engineer", "employment_types": [{"type": "permanent", "salary": {"from": 8000, "to": 10000, "currency": "pln"}}], "skills": [{"name": "Kotlin", "level": 2}, {"name": "Java", "level": 2}, {"name": "Android", "level": 2}], "remote": true, "multilocation": [{"city": "Kraków", "slug": "smartbear-release-engineer-krakow", "street": "-"}, {"city": "Wrocław", "slug": "smartbear-release-engineer", "street": "Centrum"}, {"city": "Poznań", "slug": "smartbear-release-engineer-poznan", "street": "-"}, {"city": "Warszawa", "slug": "smartbear-release-engineer-warszawa", "street": "-"}], "description": "At SmartBear, we deliver the complete visibility developers need to make each release better than the last. Our award winning and industry favorite tools TestComplete, Swagger, Cucumber, ReadyAPI, Zephyr and BugSnag are trusted by over 16 million developers, testers, and software engineers at 32,000+ organizations – including world-renowned innovators like Adobe, JetBlue, FedEx, and Microsoft.  \n\n                                                                             Release Engineer \n\n                                                                                 BugSnag \n\nYou’ll be writing code that runs when the app is crashing around it! \nWorking in a team of open-source engineers: maintaining and improving our error monitoring SDKs on GitHub \nBroad technology stack, including: JavaScript, iOS, Android, React Native, Flutter, Unreal Engine, Python, Ruby, Go and Java  \n\nAbout the product:  \nBugSnag is the trusted software stability \"command center\" for over 5,000 engineering teams worldwide, including Airbnb, Slack, Pinterest, Docker, EA and Microsoft. We process over 1 billion crash reports daily from 85,000 applications, and empower our customers to make data-driven decisions on when to focus on building new features, or when to fix bugs. \n\nGo to our product page if you want to know more about BugSnag.  \n\nYou can even have a free trial to check it out 😊   \n\nAbout the role  \nBugSnag is a cross-platform tool with an open-source crash reporting library maintained by us in over 50 different platforms. We are looking for a Release Engineer who will be responsible for collating the changes made by our engineers – as well as community contributors – and publishing releases into the many artifact repositories for our customers to use.\n\nYou will work alongside a team of experienced SDK engineers to ensure that the releases contain all the expected changes. You will follow and maintain playbooks for building, smoke testing and releasing each artifact, whilst looking for opportunities to streamline and automate the process.\n\nYou will work in a sub-team alongside CI engineers, helping to expand our Continuous Delivery and be involved in our wider automation programme\n\nAbout you \nYou should have a keen eye for detail and methodical approach to ensure releases are of a consistently high standard: following procedures precisely and looking for unexpected results.\n\nGood communication skills are essential – both the ability to discuss the content of releases and flag up issues with our engineers; and also to write formal, high-quality release notes.\n\nWe are looking for someone who relishes taking on technical challenges across a wide range of server, mobile and browser environments. You are interested in new techniques and technologies that could be used to drive forwards the automation and standardisation of our build processes.\n\nWe expect you will have:  \nAt least 2 years' experience in software engineering or DevOps\nCompetence in at least one programming language\nAn interest in build automation and CI/CD technologies\n\n#LI-FC1\nInformujemy, że administratorem danych jest SmartBear z siedzibą w 450 Artisan Way Somerville, MA 02145 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi d... more"}, {"title": "Analyst (Finance Development Team)", "street": "Koszykowa 54", "country_code": "PL", "address_text": "Koszykowa 54, Warszawa", "marker_icon": "analytics", "workplace_type": "partly_remote", "company_name": "Sollers Consulting Sp. z.o.o", "company_url": "https://sollers.eu/career/", "company_size": "800+", "experience_level": "mid", "id": "sollers-consulting-sp-z-o-o-analyst-finance-development-team", "employment_types": [{"type": "b2b", "salary": {"from": 10266, "to": 14389, "currency": "pln"}}, {"type": "permanent", "salary": {"from": 8270, "to": 12020, "currency": "pln"}}], "skills": [{"name": "Business Analysis", "level": 5}], "remote": false, "multilocation": [{"city": "Gdańsk", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-gdansk", "street": "Centrum"}, {"city": "Poznań", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-poznan", "street": "Centrum"}, {"city": "Łódź", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-lodz", "street": "Centrum"}, {"city": "Białystok", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-bialystok", "street": "Centrum"}, {"city": "Warszawa", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team", "street": "Koszykowa 54"}, {"city": "Lublin", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-lublin", "street": "Centrum"}, {"city": "Szczecin", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-szczecin", "street": "Centrum"}, {"city": "Kraków", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-krakow", "street": "Centrum"}, {"city": "Wrocław", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-wroclaw", "street": "Centrum"}, {"city": "Katowice", "slug": "sollers-consulting-sp-z-o-o-analyst-finance-development-team-katowice", "street": "Centrum"}], "description": "We are looking for a specialist who will be responsible for constant development and maintenance of internal finance-payroll system (based on workflow platform). By working as a Business Analyst, you will have a chance to optimize digital financial/payroll processes and shape future development paths for one of the most crucial back-office systems. In broader perspective, you will be a part of an Internal Systems division and by this you will have a chance to develop an internal architecture of a fast-growing IT-consulting company.\n\nYou will have opportunity to:\n\n· Be a part of a team which will maintain and develop the company’s financial-payroll system\n· Conduct complex business analysis independently, design business processes, define functional requirements and test created solutions\n· Cooperate with other analysts and IT developers on successful implementation of designed solutions\n\nWe bet on you, so we expect you to:\n\n· Have experience with SQL\n· Be familiar with any business workflow system (especially WEBCON)\n· Possess analytical skills like:\n    - gathering requirements regarding business process changes\n    - conducting meeting/workshops with internal stakeholders\n    - business process design and optimization\n· Have a very good command of English\n· Enjoy teamwork with experts with various academic backgrounds and skills\n\nWe appreciate if additionally you:\n\n· Have experience with financial IT systems (like SAP) and implementation/improvement projects\n\nWe offer you:\n\n· An open and casual company culture as well as the opportunity to explore our hobbies together, also outside of work (sport, travel, concerts, board games, food, and other)\n· The opportunity to develop professionally on IT project and to lead an area of internal system improvement\n· Clear career and salary paths\n· Health care, life insurance, Multisport card as well as trainings and certificates\n\nAbout Sollers Consulting:\n\nWe are a Team of almost 900 professionals who build the Digital Future for the world’s largest insurance, banking and leasing organisations. Our history of business advisory and software implementation goes back to the year 2000. Sollers Consulting’s roots are in Europe, but the company’s footprint is visible around the world.\n\nAs an international company with offices & projects around the world and Sollers of 20+ nationalities, we thrive in our multi-culture. We guarantee you will feel like you belong here, whether you are from Poland, the West, the East or another hemisphere.\nInformujemy, że administratorem danych jest Sollers Consuting z siedzibą w Warszawie, ul. Koszykowa 54(dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do ... more"}, {"title": "UX Writer", "street": "Przeskok 2", "country_code": "PL", "address_text": "Przeskok 2, Warszawa", "marker_icon": "ux", "workplace_type": "remote", "company_name": "BOLD PL", "company_url": "https://www.bold.com/", "company_size": "100+", "experience_level": "mid", "id": "bold-pl-ux-writer", "employment_types": [{"type": "b2b", "salary": {"from": 9240, "to": 11640, "currency": "pln"}}, {"type": "permanent", "salary": {"from": 7700, "to": 9700, "currency": "pln"}}], "skills": [{"name": "Sketch", "level": 3}, {"name": "Polish", "level": 4}, {"name": "English", "level": 4}], "remote": true, "multilocation": [{"city": "Wrocław", "slug": "bold-pl-ux-writer-wroclaw", "street": "Centrum"}, {"city": "Kraków", "slug": "bold-pl-ux-writer-krakow", "street": "Centrum"}, {"city": "Warszawa", "slug": "bold-pl-ux-writer", "street": "Przeskok 2"}], "description": "We are the Polish branch of the BOLD group, building the largest career websites in the world since 2005 with our colleagues in San Francisco, Puerto Rico, and India. Our products, intended to help people find and kick-start their dream careers, draw in over 20,000,000 visitors a month and have been featured in The Guardian, Forbes, and The Financial Times.\n\nWe're in the business of making a positive difference—and now, you can join us in helping millions of job seekers change their careers and their lives for the better.\n\nWe need your help to optimize our products using UX methods. We are opening a new role to cover product processes from the beginning.\n\nThis is an ideal opportunity for UX Writers who want to deepen their knowledge and gain experience under the guidance of an experienced design team.\n\nYou will have the opportunity to participate in developing the product at all stages and deliver impactful insights for the Product team. After a few weeks of onboarding, you can start working on your research and hypotheses to work on them with experienced product teams.\n\nHow do we work?\nWe have regular team meetings.\nOur point of reference is individual & team OKRTs (Objectives, Key Results, Tasks), which we plan every quarter.\nWe regularly meet with the team leader to discuss progress, plans, and development opportunities - this is the time for you!\nEvery 6 months, during the performance review, we discuss the two previous quarters. We have the opportunity to evaluate not only our work, but also the work of our leader.\n\nWould you like to learn more about the Product Team? Check out our team's website.\n\nYou will learn how to:\nWork collaboratively with cross-functional teams to create cohesive, user-focused product experiences.\nUse user research insights to inform content decisions and create content that meets user needs.\nWrite clear, concise, and engaging copy that guides users through product experiences.\nCreate and maintain a style guide that ensures consistency of language and tone across all product touchpoints.\nAdvocate for the user and ensure that content is inclusive, accessible, and easy to understand for all users.\n\nRequirements\n\nYour responsibilities will include:\nDesigning the user experience using language, composing and modifying digital product interface content.\nCoordinating with various stakeholders in the design process - including managers, designers, and researchers - to develop the content design.\nExpanding and updating the language style guide.\nParticipating in usability studies, especially in terms of the language used in the app.\nYou ensure linguistic correctness and text coherence in the spirit of plain language principles.\nAnalyzing the market and competition in terms of language.\n\nYou’ll be a perfect fit if you have:\nPrior work experience in a role that requires creating or editing texts.\nKnowledge in fields such as UX writing, content design, plain language, and user-centered design.\nThe ability to communicate complex ideas in a simple, easy-to-understand way.\nExcellent writing, editing, and proofreading skills focusing on grammar, punctuation, and spelling.\nKnowledge of English and Polish (at least one at a native level).\n\nNice to haves:\nBackground in writing for mobile and web applications.\nKnowledge of SEO and SEM best practices and the ability to apply them to content creation.\nExperience with internationalization and localization processes.\nFamiliarity with user research and the ability to synthesize research findings into actionable insights.\n\nTechnologies/tools we use (don’t worry, we can teach you how to use them properly):\nFigma - our primary tool, embedded in our DNA.\nFigJam - Great ideas need great boards to work on them.\nTryMata - for the unmoderated and moderated user testing longest sessions with users.\nUsabilityHub - For impression tests and much more research features.\nAxure - for testing the most advanced mockups and ideas.\nMiro - our forge of ideas, workshops or flexible tracking.\nHotJar - yes, but not for recordings :D.\nFullStory - yeah, this is a good tool for analysing the user behaviour.\nMixpanel - the most powerful analytical tool on the market.\nAP Experiments! - our powerful tool for A/B Testing. We love to experiment!\nGoogle Analytics - to extend our knowledge about SEM and SEO.\nAtlassian tools (Jira, Confluence) - for tracking and documentation purposes.\nSlack - without it, our communication would not be easy.\nA lot of brain and empathy to discover our users’ needs.\nPencil and paper :).\n\nWhat do we offer?\nFlexible working hours - we have no problem if you prefer to work early in the morning or start work at noon - you decide for yourself. We work the way we want to achieve the best results.\nRemote work - we are open to full remote candidates (from Poland). We also have office space in central Warsaw if you prefer to work on-site.\nEquipment and Internet Program - the company reimburses the Internet expenses and one-time equipment purchases to make your work comfortable when we work remotely (in addition to a laptop and necessary accessories we provide all employees with by default).\nLanguage Classes - organized by an external language school (in one of the following: English, German, Polish, Spanish, French, or Italian).\nWellness and Mental Care Programs (Yoga classes and a dedicated online platform).\nPrivate healthcare (Medicover) and Multisport Card (the company fully refunds both single packages).\nUdemy Business platform - unlimited access to 5,500+ courses.\nBy clicking \"Apply\" I express my consent to processing my personal data included in my job offer by Bold PL sp. z o.o. with its registered office in Warsaw, 00-032, ul. Przeskok 2 for recruitment purposes."}, {"title": "Java Developer", "street": "Geodezyjna 76", "country_code": "PL", "address_text": "Geodezyjna 76, Warszawa", "marker_icon": "java", "workplace_type": "remote", "company_name": "Decathlon", "company_url": "https://decathlon.pl", "company_size": "1000+", "experience_level": "mid", "id": "decathlon-java-developer", "employment_types": [{"type": "b2b", "salary": null}], "skills": [{"name": "Groovy", "level": 3}, {"name": "Spring Boot", "level": 3}, {"name": "Java 17", "level": 3}], "remote": true, "multilocation": [{"city": "Lublin", "slug": "decathlon-java-developer-lublin", "street": "Centrum"}, {"city": "Łódź", "slug": "decathlon-java-developer-lodz", "street": "Centrum"}, {"city": "Bydgoszcz", "slug": "decathlon-java-developer-bydgoszcz", "street": "Centrum"}, {"city": "Kraków", "slug": "decathlon-java-developer-krakow", "street": "Centrum"}, {"city": "Katowice", "slug": "decathlon-java-developer-katowice", "street": "-"}, {"city": "Poznań", "slug": "decathlon-java-developer-poznan", "street": "Centrum"}, {"city": "Wrocław", "slug": "decathlon-java-developer-wroclaw", "street": "Centrum"}, {"city": "Szczecin", "slug": "decathlon-java-developer-szczecin", "street": "Centrum"}, {"city": "Warszawa", "slug": "decathlon-java-developer", "street": "Geodezyjna 76"}, {"city": "Gdańsk", "slug": "decathlon-java-developer-gdansk", "street": "Centrum"}], "description": "W wewnętrznym zespole rozwoju oprogramowania tworzymy software bezpośrednio wspierający pracowników Decathlon Polska oraz zaspokajający lokalne potrzebny polskich konsumentów.\n\nJuż dziś do Naszego zespołu szukamy Java Developera, który Nam w tym pomoże.\n\nTwój zakres obowiązków:\nTworzenie testowalnego oprogramowania zgodnie ze specyfikacją projektu,\nZapewnienie niezbędnej ilość testów do tworzonego oprogramowania, \nDokumentowanie wdrażania funkcjonalności,\nPrzestrzeganie zasad przyjętych w projekcie oraz dobrych praktyk czystego kodu,\nZarządzie repozytorium projektu, dbając o jego przejrzystość i czytelność wprowadzanych zmian,\nWspółpraca ze specjalistami z obszaru technologii, optymalizacji konwersji i UX.\nOszacowywanie wysiłku (story points) lub czasu wykonania zleconych zadań,\nWspieranie analityka i projekt managera w identyfikacji potencjalnych ryzyk,\nProponowanie i wdrażanie zmian mogących poprawić efektywność rozwijanej aplikacji,\nAktywne przyczynianie się do wzrostu efektywności pracy zespołu,\nUczestnistwo w realizacji strategii jednostki.\n\nNasze wymagania:\nMinimum 2 lata doświadczenia komercyjnego,\nBardzo dobra znajomość Java 17 i Spring,\nZnajomość frameworku testowego Spock w Groovy,\nBardzo dobra znajomość relacyjnych baz danych, w szczególności PostgreSQL,\nAngielski na poziomie minimum B1.\n\nMile widziane:\nZnajomość Angular,\nZnajomość AWS SDK,\nSportowa pasja.\n\nOferujemy:\nZatrudnienie na podstawie kontraktu B2B,\nPracę zdalną.\nIndywidualny plan rozwoju,\nDopasowane szkolenia.\nPracę w międzynarodowej firmie sportowej,\nWyjątkową sportową atmosferę.\n\nJesteś gotów/gotowa, aby dołączyć do naszego zespołu?\n\nAplikuj, nie czekaj! Wyślij swoje CV już dziś! A jeśli znasz kogoś, kto sprawdziłby się na tym stanowisku, przekaż link dalej. Dziękuję.\n\nInformujemy, że administratorem danych jest Decathlon sp. z o.o z siedzibą w Warszawie, ul. Geodezyjna 76, 03-290 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesieni... more"}, {"title": "Business Analyst", "street": "Geodezyjna 76", "country_code": "PL", "address_text": "Geodezyjna 76, Warszawa", "marker_icon": "analytics", "workplace_type": "partly_remote", "company_name": "Decathlon", "company_url": "https://decathlon.pl", "company_size": "1000+", "experience_level": "mid", "id": "decathlon-business-analyst", "employment_types": [{"type": "b2b", "salary": null}, {"type": "permanent", "salary": null}], "skills": [{"name": "SQL", "level": 3}, {"name": "Data", "level": 4}, {"name": "Business Analysis", "level": 4}], "remote": false, "multilocation": [{"city": "Warszawa", "street": "Geodezyjna 76", "slug": "decathlon-business-analyst"}], "description": "Decathlon is a chain of stores all over the world. Full of sports, brands of passion and innovation. We offer our users attractive prices, high-quality advice and service.\n\nInvariably, for over 40 years, the meaning of our existence and the impulse to take action by our employees is \"to enable as many people as possible to enjoy and benefit from practicing sport\". Today we are looking for a new Data Team member who will support the company in creating business value from data we collect.\n\nJOB DESCRIPTION\n\nPartnering with business stakeholders to understand their objectives, and scope how their business problems might be solved with data \nProactively suggesting analysis supporting business decisions\nMaking recommendations based on findings to improve a particular area in a business\nAssist in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing, and reporting data.\nIdentifying opportunities to improve information management\nCommunicating requirements and partnering with relevant technology and data specialists\n\nEXPECTATIONS\n\nAt least 5 years of relevant experience in data roles \nCurious and business outcome focused with an ability to quickly understand a business area\nFocused on creating real business value with data based solutions\nUnderstanding of statistics and methods used by data scientists\nStrong collaboration skills having worked with business stakeholders at different levels of seniority and technical proficiency \nExcellent written and oral communication skills – being able to both interpret and articulate complex information in a clear, concise way \nBroad understanding of data strategy and how data can be used to transform business\nProject management or leading small projects in data domain\nAt least basic knowledge of SQL\n\nNICE-TO-HAVE\n\nPrior experience in retail/ e-commerce\nFamiliarity with at least one of the data visualisation solutions (Tableu/ PowerBI/ Data Studio/ Quicksight)\nSome experience in methods used by data science\nPrior experience with R/Python might be very helpful in this role\n\nOUR OFFER\n\nOpportunity to work and develop your talents in a fast-moving global environment\nDevelopment in dynamic ecommerce and brick sector\nOpportunity to work with leading technologies\nOpen and fun working environment\nIndividual development path after the trial period\nB2B or employment contract\nIndividual learning path after the trial period\nBase salary complimented by monthly and quarterly bonus \nPrivate medical care\nRetirement plan paid by the company\nEmployee discount in Decathlon stores\nTesting Decathlon products\nUnique, sporty work culture\n\nAdditional information:\n- first 3 months stationary work\n- after 3 months - partly remote (4 times a month in the office)\n\nInformujemy, że administratorem danych jest Decathlon sp. z o.o z siedzibą w Warszawie, ul. Geodezyjna 76, 03-290 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesieni... more"}, {"title": "Software Support Engineer", "street": "Pawia, 17", "country_code": "PL", "address_text": "Pawia, 17, Kraków", "marker_icon": "python", "workplace_type": "partly_remote", "company_name": "Qualtrics", "company_url": "https://www.qualtrics.com/", "company_size": "5000+", "experience_level": "junior", "id": "qualtrics-software-support-engineer-krakow", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "Perl", "level": 2}, {"name": "Python", "level": 2}, {"name": "Bash", "level": 2}], "remote": false, "multilocation": [{"city": "Kraków", "slug": "qualtrics-software-support-engineer-krakow", "street": "Pawia, 17"}, {"city": "Katowice", "slug": "qualtrics-software-support-engineer-66ea3615-d66b-41ae-b389-7d15e020a64f", "street": "Centrum"}, {"city": "Gliwice", "slug": "qualtrics-software-support-engineer-984d28c0-0766-4158-9390-2e3805d1caba", "street": "Centrum"}], "description": "The Qualtrics XM Platform™ is a system of action that helps businesses to attract customers who stay longer and buy more, to engage and empower employees to do the best work of their lives, to develop breakthrough products people love, and to build a brand people can’t imagine living without.\n\n\nJoining Qualtrics means becoming part of a team bold enough to chase breakthrough experiences - like building a technology that will be a force for good. A team committed to diversity, equity, and inclusion because of a conviction that every voice holds value, with a vision for representation that matches the world around us and inclusion that far exceeds it. You could belong to a team whose values center on transparency, being all in, having customer obsession, acting as one team, and operating with scrappiness. All so you can do the best work of your career.\n\n\nWe believe every interaction is an opportunity. Are we yours?\n\n\nThe team\n\n\nXM Discover provides a deep understanding of customers and employees by evaluating the actual words they use. The industry's leading AI-powered speech and text analytics engine analyzes all feedback and conversations at scale to reveal topics, perception of effort, emotion, empathy, sentiment, reasons for actions, intent and more. Insights from XM Discover are used to build a more holistic experience management (XM) strategy and stronger relationships with employees and customers as a result.\n\n\nAs a member of the XM Discover Platform scrum development team, you will be collaborating with other progressive engineers to  bring our software to the next levels of scalability, performance, security, and functionality.  This stack processes very large amounts of data using a variety of open-source technologies such as Java, Elastic, Kafka, Spring, Docker, Kubernetes, Postgres, Jenkins, Ansible, and others.  In this role there is lots of opportunity for growth - you will start with responsibility for both story-level and epic-level work, and broaden out from there.  As with all of our engineering roles, you will have influence on design and implementation and will be able to both mentor and be mentored.\n\n\nThe challenge:\n\n\nAs a Support Engineer at Qualtrics, you will be working with customer support as a part of the engineering team to address issues reported by customers and help them realize the full potential of the system. You will:\n\n\nTriage and analyze customer-reported issues\nInvestigate application code and application logs to identify root causes\nImplement fixes or provide necessary information to application engineers\nDesign and implement tools and reports that will speed up the resolution\nUse existing tools and reports\nCooperate with Engineering, Customer Success, Customer Support  and Product Management teams, both locally and internationally\nIdentify trends in application quality and performance\nImplement and monitor alerts based on quality and performance trends\n  Skills required:\n\n\nAbility to read code (like Java, Node, Go)\nAbility to read application logs\nFamiliarity with one of the scripting languages (Bash, Python, Perl or other)\nAbility to write SQL queries and execute common DB operations (extracts, mass delete etc)\nExperience in diagnosing customer production issues\nExperience building and/or managing software deployment pipelines (CI/CD)\nExcellent English communication skills, written and spoken\nAnalytical thinking\nProactive approach to issues and trends \n\nExperience:\n\n\nBachelor’s degree - STEM (Science, Technology, Engineering, and Mathematics)\nExperience in support engineering including developing scripts and software\n  What differentiates us from other companies:\n\n\nWork-life integration is deeply important to us - we have frequent office events, team outings, and happy hours.\nWe take pride in our offices design aiming at cultivating creativity from our rooftop views to an open and collaborative work space.\nOn top of the standard benefits package (medical, dental, vision, life insurance, etc) we provide snacks, drinks, and free lunches in our office.\nWe believe in sharing Qualtrics success which is part of the compensation for all employees.\n\n\n\n\nInformujemy, że administratorem danych jest QPL Technologies z siedzibą w Krakowie, ul. Pawia 9 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu... more"}, {"title": "Senior DevOps Engineer", "street": "Lotnicza 12", "country_code": "PL", "address_text": "Lotnicza 12, Wrocław", "marker_icon": "devops", "workplace_type": "remote", "company_name": "Nokia", "company_url": "http://nokiawroclaw.pl/en/", "company_size": "3000+", "experience_level": "senior", "id": "nokia-senior-devops-engineer-wroclaw", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "Python", "level": 3}, {"name": "Bash", "level": 3}, {"name": "DevOps", "level": 4}], "remote": true, "multilocation": [{"city": "Wrocław", "slug": "nokia-senior-devops-engineer-wroclaw", "street": "Lotnicza 12"}, {"city": "Lublin", "slug": "nokia-senior-devops-engineer-628fa0a8-cca9-48fa-9001-82178df72f0b", "street": "Centrum"}, {"city": "Kraków", "slug": "nokia-senior-devops-engineer-7499a979-d7af-4cd5-86ec-01cbc2b0b38b", "street": "Centrum"}, {"city": "Warszawa", "slug": "nokia-senior-devops-engineer-80502878-c10f-4dad-bc77-266fffcf7ee0", "street": "Centrum"}, {"city": "Szczecin", "slug": "nokia-senior-devops-engineer-91151bcf-a887-4082-bd86-ce139c0bfcf3", "street": "Centrum"}, {"city": "Łódź", "slug": "nokia-senior-devops-engineer-89bf1568-63c7-47fc-a38e-78b1a6753a59", "street": "Centrum"}, {"city": "Katowice", "slug": "nokia-senior-devops-engineer-790842bb-940e-4cd8-8744-0308d8eac3f4", "street": "Centrum"}, {"city": "Gdańsk", "slug": "nokia-senior-devops-engineer-769b36a0-798f-432e-adf3-032718fdf521", "street": "Centrum"}, {"city": "Bydgoszcz", "slug": "nokia-senior-devops-engineer-cd3f494a-6262-4da3-b183-444bba637d8a", "street": "Centrum"}, {"city": "Poznań", "slug": "nokia-senior-devops-engineer-cca65e6b-7a0e-4208-8004-cebb2ceacdcd", "street": "Centrum"}], "description": "Come create the technology that helps the world act together\nNokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. \nWe challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work.\n\nThe team you’ll be part of\nWe are currently the largest institution of research and development in the ICT sector in Poland, successively growing and still looking for new talents. DevOps Specialist is one of the key positions in R&D Centers in Poland and at present, there are a few slightly different departments possibly interested in your experience. Find out which specific departments are currently recruiting for this position: Check our DevOps hiring teams\n\nBelow you will find some general information about our expectations in the DevOps Specialist positions.\n\nWhat you will learn and contribute to\nDesigning, implementing and maintaining a build processes for multiple concurrent releases of embedded software\nPrototyping concepts which proofs feasibility of complex solution proposals\nleading development of technologies, tools and solutions\nProposing improvements across whole CI and automation environment\nWriting scripts to automate build and deployment processes through build systems\nOptimizing existing build jobs for simplicity and speed\nExecuting test suites in the continuous integration process\n Your skills and experience\nGood command of English language\nAdvanced Bash, Python, C/C++ knowledge\nKnowledge of containers (Docker, LXC) and container orchestrators (Kubernetes)\nPractical experience with version control system git\nDeep Linux knowledge incl. kernel, drivers know-how, administration aspects (user mgmt, network configuration, storage setup, etc\nExperience with CI/CD systems, GCC compilers\nAbility to structure complex tasks, problem solving skills\n  What we offer\nNokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs, and highly diverse teams with an inclusive culture where people thrive and are empowered.\n Nokia is committed to inclusion and is an equal opportunity employer\nNokia has received the following recognitions for its commitment to inclusion & equality:\nOne of the World’s Most Ethical Companies by Ethisphere\nGender-Equality Index by Bloomberg\nWorkplace Pride Global Benchmark\nLGBT+ equality & best place to work by HRC Foundation\n At Nokia, we act inclusively and respect the uniqueness of people.\nNokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\nWe are committed to a culture of inclusion built upon our core value of respect.\n\nJoin us and be part of a company where you will feel included and empowered to succeed.\nInformujemy, że administratorem danych jest Nokia Solutions and Networks Sp. z o.o. z siedzibą w Warszawie, ul. Rodziny Hiszpańskich 8 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia ... more"}, {"title": "Sr TechnicalCurriculum Developer/Trainer", "street": "Długa", "country_code": "PL", "address_text": "Długa, Kraków", "marker_icon": "python", "workplace_type": "remote", "company_name": "Splunk", "company_url": "https://www.splunk.com/", "company_size": "8,000", "experience_level": "senior", "id": "splunk-sr-technicalcurriculum-developer-trainer", "employment_types": [{"type": "permanent", "salary": {"from": 16000, "to": 21000, "currency": "pln"}}], "skills": [{"name": "Python", "level": 1}, {"name": "C++", "level": 1}, {"name": "Java", "level": 1}], "remote": true, "multilocation": [{"city": "Kraków", "street": "Długa", "slug": "splunk-sr-technicalcurriculum-developer-trainer"}], "description": "The Engineering Enablement & Education team is responsible for addressing the technical learning and knowledge needs of all engineers that develop Splunk products. The programs and solutions delivered by the team enable technical productivity and engineers’ growth to meet career goals. Our team’s goal is to build an extraordinary engineering organization through learning and knowledge sharing. Programs and solutions delivered by the team include technical onboarding, Tech Talks, internal technical documentation, code labs, technical training classes, and hackathons.\n\n\nWe’re seeking a Senior Technical Curriculum Developer/Trainer who will be a force multiplier to upskill thousands of engineers by analyzing, designing, implementing, and delivering extraordinary learning and knowledge sharing programs. This role is critical to help the team scale and will influence the shape of the knowledge sharing culture at the company.\n\n\nWhat You’ll Be Doing:\n\nLearn from our engineers to understand how Splunk products work and how our software is crafted, developed, tested, and deployed\nFollow instructional design best practices to analyze knowledge gaps, assess training needs, and develop engaging live or self-paced learning programs\nCreate and maintain classroom content, labs, and codebases\nTeach one or more technical classes\nAssess the efficiency of learning programs and how they have impacted productivity and business objectives\nAct as a consultant to stakeholders to provide the most effective ways to improve learning, technical documentation, and knowledge sharing within their organizations\nManage the delivery of training programs crafted by yourself or others\nDevelop or maintain tools that optimize training delivery and operations\nFoster a culture of learning that promotes inclusion and diversity in our teams, interactions, and learning models\n\nWho You Are and What Makes You Qualified:\n\nDemonstrated ability to learn technical concepts\nDemonstrated ability to collaborate with a diverse group of technical subject-matter experts to build, maintain and deliver technical content\nExperience developing software in C++, Java, Python, Javascript, or similar programming languages\nExperience in technical curriculum development, technical writing, or delivering live classroom training\nUnderstanding of how software engineers learn and acquire new skills and knowledge\nExperience with elearning or video editing tools such as Articulate Storyline, Rise, Camtasia, Vyond, Descript\nAbility to assess knowledge gaps and learning needs through various data points\nKnowledge of Learning Management Systems\nAbility to optimally collaborate with geographically distributed teams\n\nEducation:\n\n\nMinimum of 5+ years of related experience with a Bachelor’s degree, preferably in computer science or a related field. \n\n\nJoin us as we pursue our vision to make the world a place where data provide clarity, elevates discussion, and accelerates progress for everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey.\n\nInformujemy, że administratorem danych jest Splunk z siedzibą w Kraków, ul. Długa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego. ... more"}, {"title": "Programista Embedded (C/C++ / C +Python)", "street": "Centrum", "country_code": "PL", "address_text": "Centrum, Kraków", "marker_icon": "python", "workplace_type": "partly_remote", "company_name": "GRH Polska", "company_url": "http://www.grhpolska.com", "company_size": "100-150", "experience_level": "mid", "id": "grh-polska-programista-embedded-c-c-c-python-krakow", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "C++", "level": 2}, {"name": "Python", "level": 3}, {"name": "C", "level": 3}], "remote": false, "multilocation": [{"city": "Katowice", "slug": "grh-polska-programista-embedded-c-c-c-python-cff37dc5-cf1c-4d30-888a-90127e598e43", "street": "Centrum"}, {"city": "Kraków", "slug": "grh-polska-programista-embedded-c-c-c-python-krakow", "street": "Centrum"}, {"city": "Tarnów", "slug": "grh-polska-programista-embedded-c-c-c-python-tarnow", "street": "Centrum"}], "description": "Szukamy Programisty Embedded (C/C++ lub C i Python) do oddziału w Krakowie (60% pracy zdalnej – 40% stacjonarnej).\n\nO projekcie:\n\nZajmiesz się tworzeniem i testowaniem niskopoziomowego oprogramowania wbudowanego do łączności bezprzewodowej Bluetooth oraz WiFi (CSR, Texas, Silicon, Labs, Dialog) – współpraca z zagranicznym klientem nad innowacyjnymi produktami.\n\nBrzmi ciekawie?\n\nAplikuj, jeśli możesz pochwalić się:\n\nDoświadczeniem w pracy na podobnym stanowisku\nZnajomością programowania układów mikroprocesorowych (C/C++, Python)\nKomunikatywną znajomością j. angielskiego – wykorzystywany do rozmów z Klientem i dokumentacji\nWykształceniem wyższym technicznym\n  Od pracodawcy otrzymasz:\n\nUmowę o pracę\nElastyczne godziny pracy, rozpoczęcie między 7.00 a 10.00 (poniedziałek - piątek), a dodatkowo 60% pracy zdalnej\nWynagrodzenie dopasowane do posiadanego doświadczenia i umiejętności\nOpiekę medyczną prywatną dla Ciebie i Twoich bliskich\nIndywidualnie dopasowany do Twoich zainteresowań plan szkoleń i wydarzeń branżowych\nZaplanowana ścieżka rozwoju z możliwością rozwoju w wybranym przez Ciebie kierunku (14 ścieżek rozwoju zawodowego)\nDostęp do darmowego basenu i siłowni (również dla członków rodziny)\nDarmowy parking (również możliwość parkowania rowerów i motocykli)\nBardzo dobrze zorganizowaną strefę pracy - bliska odległość basenu, siłowni, firmowej restauracji, sklepów, foodtrucków\nLaptopy i komputery PC z monitorami panoramicznymi\nPrzestronne pokoje w nowoczesnym biurowcu (brak open space`ów, każdy z projektów ma własny pokój)\nWysokiej jakości sprzęt pomiarowy oraz bardzo dobrze wyposażone laboratorium\nBezpośredni kontakt z kadrą kierowniczą oraz płaska struktura organizacyjna\nImprezy integracyjne oraz wspólne inicjatywy dla lokalnych społeczności\n Masz pytania?\nZadzwoń: 780 026 201\nLub wyślij CV i zacznij pracę, którą pokochasz! \nInformujemy, że administratorem danych jest GRH Polska z siedzibą w Rzeszowie, ul. Laurowa 2(dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu na... more"}, {"title": "Specjalista ds. wsparcia IT", "street": "Bonifraterska 17", "country_code": "PL", "address_text": "Bonifraterska 17, Warszawa", "marker_icon": "support", "workplace_type": "partly_remote", "company_name": "Emerge IT Support", "company_url": "https://emergeitsupport.pl/", "company_size": "25", "experience_level": "mid", "id": "emerge-it-specjalista-ds-wsparcia-it", "employment_types": [{"type": "b2b", "salary": null}, {"type": "permanent", "salary": null}], "skills": [{"name": "Bazy Danych", "level": 3}, {"name": "SQL", "level": 3}], "remote": false, "multilocation": [{"city": "Warszawa", "street": "Bonifraterska 17", "slug": "emerge-it-specjalista-ds-wsparcia-it"}], "description": "W Emerge IT Support realizujemy kompleksowe usługi IT dla biznesu.\n\n\nW codziennej pracy łączymy nasze doświadczenie w branży z indywidualnym podejściem do każdego Klienta, oferując profesjonalne rozwiązania informatyczne w ramach outsourcingu usług IT – począwszy od service desku, poprzez zarządzanie infrastrukturą sieciową, aż do wdrożenia aplikacji biznesowej.\n\n\nJeżeli chcesz rozwijać swoje umiejętności w obszarze wsparcia IT/service desk…\n\n\n\nDodatkowo zależy Ci na pracy w zgranym zespole, w którym panuje przyjazna atmosfera…\n\n\n\nCo więcej, nie boisz się nowych wyzwań i lubisz pomagać innym.\n\n\nTo znaczy, że czekamy właśnie na Ciebie!\n\n\n\nSpecjalista ds. wsparcia IT\nMiejsce pracy: Warszawa\n\nTwoje zadania:\nWsparcie IT w zakresie obsługi sprzętu oraz oprogramowania;\nAnaliza i rozwiązywanie zgłaszanych problemów dotyczących sprzętu komputerowego, oprogramowania i sieci;\nDiagnozowanie problemów i kategoryzacja według stopnia ważności;\nInstalacja infrastruktury sieciowej oraz oprogramowania;\nNaprawa awarii hardware i software oraz nadzór nad prawidłowym funkcjonowaniem sprzętu oraz jego instalacja i konfiguracja;\nInstalacja i upgrade oprogramowania na desktopach i laptopach;\nMonitorowanie bezpieczeństwa stacji roboczych;\nTworzenie i utrzymanie dokumentacji technicznej systemów informatycznych;\nZarządzanie uprawnieniami, ewidencja sprzętu.\n\nJesteś idealnym kandydatem? Sprawdź czy:\nPosiadasz umiejętność instalacji, konfiguracji oraz administrowania systemami operacyjnymi (Windows, Linux, OS X);\nMożesz wykazać się znajomością zagadnień dot. budowy oraz konfiguracji sieci komputerowych LAN/WAN/WLAN;\nPosiadasz umiejętność konfiguracji oraz administracji urządzeniami sieciowymi (modemy, routery, switche itp.);\nPosiadasz znajomość serwerowych systemów operacyjnych, zagadnień AD, MS Exchange, Office 365;\nMasz doświadczenie w administracji bazami danych SQL (MsSQL, MySQL, Firebird, Pervasive);\nZajmowałeś/aś się administracją systemami antywirusowymi, zarządzaniem systemami backup’owymi, administracją systemami wirtualizacji;\nZnasz język angielski na poziomie umożliwiającym czytanie dokumentacji technicznej\nSzybko się uczysz i chętnie podejmujesz nowe zadania;\nLubisz pracę z ludźmi w dynamicznym środowisku pracy;\nCechuje Cię odpowiedzialność i duże zaangażowanie w prowadzone projekty.\n\nDodatkowym atutem będą:\nUkończone studia wyższe o profilu informatycznym lub pokrewnym;\nZnajomość baz danych oraz języka SQL;\nPrawo jazdy kat. B;\nDoświadczenie w pracy na rzecz różnorodnych Klientów będzie dodatkowym atutem.\nWiedza z zakresu ITIL oraz umiejętność pracy na systemach rejestracji zgłoszeń;\nZnajomość języka angielskiego na poziomie B2\n\nCo oferujemy?\nPrywatną opiekę medyczną;\nDofinansowanie karty Benefit Multisport;\nMożliwość zdobycia doświadczenia w dynamicznie rozwijającej się firmie;\nPracę w zgranym zespole ekspertów w świetnej atmosferze;\nDużą samodzielność w działaniu;\nElastyczną formę współpracy (umowa o pracę lub umowa B2B).\n\nBrzmi interesująco? \nInformujemy, że administratorem danych jest Emerge IT Support z siedzibą w Warszawa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego... more"}, {"title": "Programista Webowy", "street": "Centrum", "country_code": "PL", "address_text": "Centrum, Kraków", "marker_icon": "net", "workplace_type": "remote", "company_name": "CottonBee", "company_url": "https://ctnbee.com/", "company_size": "20-30", "experience_level": "mid", "id": "cottonbee-web-developer", "employment_types": [{"type": "b2b", "salary": {"from": 12800, "to": 19200, "currency": "pln"}}], "skills": [{"name": "Angular", "level": 3}, {"name": "Ruby", "level": 3}, {"name": ".Net", "level": 3}], "remote": true, "multilocation": [{"city": "Kraków", "slug": "cottonbee-web-developer", "street": "Centrum"}, {"city": "Rzeszów", "slug": "cottonbee-programista-webowy", "street": "Centrum"}, {"city": "Katowice", "slug": "cottonbee-programista-webowy-katowice", "street": "-"}], "description": "CottonBee to pierwsza w Polsce internetowa drukarnia materiałów do szycia. Jesteśmy firmą tekstylną nowej generacji - od 2014 dostarczamy naszym klientom usługi druku cyfrowego na materiałach. Aktualnie ponad 80% produkcji trafia na rynki zagraniczne. Rozwijamy naszą autorską platformę e-commerce web-to-print zintegrowaną z autorskim systemem zarządzającym i automatyzującym proces produkcji.\n\nW tym roku, podobnie jak w ubiegłym, znaleźliśmy się na liście Deloitte Technology Fast50 CE 2022jako jedna z 50 najszybciej rozwijających się firm technologicznych CEE. W 2021 Instytut Wzornictwa Przemysłowego wyróżnił nas nagrodą Dobry Wzór dla najlepiej zaprojektowanych produktów i usług w Polsce.\n\nW związku z poszerzaniem zespołu developerskiego, poszukujemy osoby, która pomoże nam w wytwarzaniu najwyższej jakości oprogramowania i w rozbudowie naszej platformy.\n\nNasz zespół developerski jest w Krakowie, biznes i produkcja w Płocku, ale obecnie nie ma znaczenia skąd będziesz dla nas pracował/a.  Zależy nam jednak żebyś 2,3 razy w miesiącu był/a w stanie przyjechać do Krakowa, gdzie jest nasz CTO, żeby się spotkać, porozmawiać czy zrobić warsztaty z zespołem. Łatwiej pracować przy projektach i budować relacje znając się nie tylko z monitora. 🙂\n \n👉 Chcielibyśmy, żebyś rozwijał/a się wspólnie z nami, dlatego interesuje nas stała, długofalowa współpraca. Jeżeli masz otwartą głowę, nie lubisz pracy od A do Z i chcesz mieć realny wpływ na sprawy, nad którymi pracujesz, to odezwij się do nas.\n\nCzym będziesz zajmował/a się w CottonBee?\n\nWspółpracą z zespołem w zakresie definiowania rozwiązań dla wymagań biznesowych\nRozwojem systemu e-commerce i narzędzi wspomagających go\nDokumentowaniem wyników swojej pracy\nBędziesz mieć wpływ na jakość produktu w całym cyklu wytwarzania oprogramowania.\n\n\nJakich technologii używamy?\n\nW obrębie naszego systemu używamy kilku technologii. W przypadku aplikacji backendowych opieramy się o język ruby i framework Ruby on Rails oraz platformę .NET (Core). Jako silnik bazodanowy wykorzystujemy głównie PostgreSQL, w niewielkim zakresie korzystamy również z Redisa oraz MongoDB.\nJeśli chodzi o część frontendową to jako podstawę do tworzenia naszych aplikacji SPA wykorzystujemy Angulara.\n\nNasza infrastruktura oparta jest o usługi Microsoft Azure.\n\nKogo poszukujemy?\n\nProgramisty/ki, który/a pomoże rozwijać nam określone części naszego systemu - zgodnie ze swoją wiedzą i doświadczeniem. Oczekujemy zatem, że wykażesz się:\n\nZnajomością przynajmniej jednej z technologii wykorzystywanej w naszym projekcie (patrz wyżej)\nZnajomością systemów bazodanowych (PostgreSQL, MongoDB, Redis) - w przypadku pracy z technologiami backendowymi.\nUmiejętnością pracy z zewnętrznymi API oraz zasad budowania API (REST)\nWiedzą z zakresu technologii frontendowych (HTML, CSS, JS) - w przypadku pracy z technologiami frontentowymi\nChęcią rozwoju i nauki nowych technologii\nDoskonałą samoorganizacją oraz szacowaniem pracochłonności swojej pracy\nDobrymi umiejętności komunikacyjnymi i umiejętnością pracy w zespole rozproszonym\nDoświadczeniem w pracy z komercyjnym projektem\n\nJeśli to co napisaliśmy, wydaje Ci się ciekawe, ale nie masz doświadczenia zgodnego z opisem, masz natomiast wiedzę, jesteś zmotywowany i poszukujesz nowych wyzwań, to odezwij się do nas, chętnie porozmawiamy.\n\n Co możemy Ci zaoferować?\n\nCiekawą pracę w firmie, która realnie digitalizuje branżę tekstylną, ma ambicje i jest na dobrej drodze, żeby zostać jednym z liderów europejskich tej kategorii.\nSamodzielne stanowisko ze wsparciem doświadczonego zespołu developerów\nMożliwość rozwoju umiejętności, które już posiadasz oraz potencjalną możliwość nauki nowych technologii\nWspółpracę w oparciu o kontrakt B2B/staż/praktyki - w zależności od Twojego doświadczenia.\nElastyczne godziny (w ramach zdrowego rozsądku) i zdalny model współpracy (jednak od czasu do czasu chcielibyśmy mieć możliwość się spotkać w Krakowie).\n\n Zapraszamy do aplikowania i do zobaczenia!\nInformujemy, że administratorem danych jest Prosker Sp. z o.o. z siedzibą w Płocku, ul. Kostrogaj 9D (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do o... more"}, {"title": "Technical Consulting Engineer (LAN)", "street": "Centrum", "country_code": "PL", "address_text": "Centrum, Katowice", "marker_icon": "admin", "workplace_type": "remote", "company_name": "Cisco Systems", "company_url": "http://www.cisco.com", "company_size": "79,500+", "experience_level": "mid", "id": "cisco-systems-technical-consulting-engineer-lan-katowice", "employment_types": [{"type": "permanent", "salary": {"from": 14000, "to": 18500, "currency": "pln"}}], "skills": [{"name": "WAN", "level": 3}, {"name": "LAN", "level": 3}, {"name": "Enterprise", "level": 3}], "remote": true, "multilocation": [{"city": "Łódź", "slug": "cisco-systems-technical-consulting-engineer-lan-lodz", "street": "Centrum"}, {"city": "Szczecin", "slug": "cisco-systems-technical-consulting-engineer-lan-szczecin", "street": "Centrum"}, {"city": "Katowice", "slug": "cisco-systems-technical-consulting-engineer-lan-katowice", "street": "Centrum"}], "description": "What You’ll Do?\nWork directly with customers to tackle complex technical issues\nDiagnose, troubleshoot and resolve incidents related to Cisco products (mainly related to Cisco's Catalyst switches), services, and solutions\nBe a member of an international team of trusted technical experts to worldwide Cisco customers and partners\nEngage in cross-technology collaborations\nRecreate customer technical problems within Cisco’s internal state-of-the-art labs\nBe the first to lay hands on the latest and greatest cutting-edge technologies within the enterprise domain\nCollaborate with the engineering teams to improve product quality by identifying and submitting software defects\n\nWhat do we expect from you:\nKnowledge of network and transport infrastructure protocols\nSolid understanding of network infrastructure and network hardware (mainly enterprise-class routers & switches)\nLAN and WAN production environment experience\nGood analytical and problem-solving skills\nAbility to understand the network, narrow down the issue and implement the fix\nAbility to quickly adopt and learn new technologies and products using documentation and internal resources\nStrong experience working with external customers. Good communication skills and ability to manage different stakeholders\nStrong end-to-end ownership and drive toward resolving customers' problems.\nWorking independently, but comfortable in a team environment\n\nWe'll be very impressed if you can also show one of these:\nKnowledge and experience in at least one of the network switching products: C2k/C3k/C4k/C6k/C9k/Industrial Ethernet Switches\nHold a current valid industry-recognizable accreditation\nBasic knowledge of any programming language (preferably Python)\n\nWhat’s in it for You?\nUnique possibility to work fully remote from your location within the European Union\nYou will get targeted, structured training helping you to ramp up your knowledge\nYou will be given a mentor that will help you to get up to speed and grow in your first few months\nYou will join a team of great people who are experts in what they do while sharing an atmosphere where everyone supports each other and grows\nOpportunity to shape yourself into an industry-leading networking expert with outstanding problem-solving and network troubleshooting skills\nUnlimited access to any of Cisco’s hardware and software products from across the entire Cisco portfolio\nExceptional opportunities to grow - including access to resources, a variety of trainings, certification paths (e.g. CCIE/DevNet), rotations to different technology teams\nReal impact on Cisco business by participating in internal projects focusing on automation, product development and adoption, process and tools optimization\nYou will be able to master communication and client engagement skills by being exposed to customers and stakeholders on many levels\nStable working hours: Monday – Friday 8am – 4pm Central European Time (with periodic weekend shifts on Saturday or Sunday 8am – 2pm – with additional monetary and a day off compensation).\n\nWhy Cisco?\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\nCisco is not only an industry leader and the place to work for network engineers but also has unique and amazing work culture and year by year is on the top of the greatest places to work worldwide.\nInformujemy, że administratorem danych jest Cisco Systems z siedzibą w Warszawie, ul. Domaniewska 39B (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do ... more"}, {"title": "Senior Software Engineer (Fullstack)", "street": "Domaniewska 48", "country_code": "PL", "address_text": "Domaniewska 48, Warszawa", "marker_icon": "python", "workplace_type": "remote", "company_name": "IQVIA Commercial Sp. z o.o.", "company_url": "https://www.iqvia.com/", "company_size": "55000+", "experience_level": "senior", "id": "iqvia-commercial-sp-z-o-o-software-engineer-fullstack", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "JavaScript", "level": 3}, {"name": "SQL", "level": 3}, {"name": "Python", "level": 3}], "remote": true, "multilocation": [{"city": "Szczecin", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-szczecin", "street": "Centrum"}, {"city": "Poznań", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-poznan", "street": "Centrum"}, {"city": "Katowice", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-katowice", "street": "Centrum"}, {"city": "Lublin", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-lublin", "street": "Centrum"}, {"city": "Gdańsk", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-gdansk", "street": "Centrum"}, {"city": "Warszawa", "slug": "iqvia-commercial-sp-z-o-o-software-engineer-fullstack", "street": "Domaniewska 48"}, {"city": "Wrocław", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-81fb77f1-c026-482d-9735-4377a4272e2c", "street": "Centrum"}, {"city": "Łódź", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-lodz", "street": "Centrum"}, {"city": "Kraków", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-c9d3cdc6-22fc-4ad8-a835-1f953e17782d", "street": "Centrum"}, {"city": "Bydgoszcz", "slug": "iqvia-commercial-sp-z-o-o-senior-software-engineer-fullstack-bydgoszcz", "street": "Centrum"}], "description": "Our Analytics Center of Excellence (ACOE) harnesses our global healthcare insights, working closely with our clinical and therapeutic experts to power evidence-driven design, speed site activation and recruit the right patients, faster. We’re using big data and advanced analytics to derive insights that transform clinical development and bring new medicines to patients faster through successful trial delivery.\nThis multi-functional team is an innovation for our business, requiring entrepreneurial and independent thinking to build our capability. Unique and with a global view, this Center of Excellence is a chance to revolutionize the clinical research industry.\nInvolved in every stage of the product development lifecycle, you will work with data scientists to turn working prototypes into well-abstracted reusable services, build software to expose data science models to business users through responsive UIs, and support a culture of continuous improvement. As a software engineer, you will contribute to the architecture and shape coding standards.\n\nSome of the things you'll be doing include…\nBuilding analytic experiences powered by python backends that are highly performant on huge datasets.\nUsing the full capabilities of Javascript/React, and python to build a pioneering product.\nWorking to promote and ensure best practices and modern approaches are applied to challenging UI/UX problems.\nHelping product managers and designers iteratively build and refine their plans.\nWorking with the entire team in a collaborative environment where all suggestions are encouraged, and all ideas thoughtfully considered.\n\nLet's talk about you...\nExperience (5+ years) building commercial software products as part of a team. We build using JavaScript (React), and python; you have professional experience with one or a combination of these.\nEducated. A related technical degree is preferred.\nYou make an IMPACT. You take initiative and lead team members to turn ideas into real features, passionate about discussing use cases & user flows with product managers & designers and contributing ideas to those discussions.\nYou’re Front-End Focused. You love working proactively with product management and UX to refine and iterate on specifications as the product takes shape.\nYou’re Quality-Focused. You write code that’s well-tested, performs well, and fails gracefully.\nYou're Customer-Focused. You have opinions about how users will use the product, and what problem they might run into. Being interested and willing to dive into and understand customers' problems is both helpful and rewarding.\nYou’re Driven. You set challenging goals for yourself and push yourself to meet them; you have a passion for delivering high-quality quickly; and you enjoy working at a fast pace.\nYou’re Collaborative. You enjoy collaborating with, learning from, and teaching others so we all can become better. You treat your colleagues with honesty, kindness, and respect and actively do your part to create a positive work environment.\nYou’re Humble. You are unafraid to ask questions when you don’t know the answer, and you approach disagreements with the possibility that you might be wrong.\n\nWe know that meaningful results require not only the right approach but also the right people. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward. Whatever your career goals, we are here to ensure you get there!\n\nInformujemy, że administratorem danych jest IQVIA z siedzibą w Warszawie, ul. Domaniewska 48 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu na... more"}, {"title": "SAP Basis Administrator", "street": "Rubież 46", "country_code": "PL", "address_text": "Rubież 46, Poznań", "marker_icon": "admin", "workplace_type": "partly_remote", "company_name": "Apollogic", "company_url": "https://apollogic.com/pl/", "company_size": "120", "experience_level": "mid", "id": "apollogic-sap-basis-administrator", "employment_types": [{"type": "permanent", "salary": {"from": 8000, "to": 14000, "currency": "pln"}}], "skills": [{"name": "English", "level": 3}, {"name": "Linux", "level": 3}, {"name": "SAP", "level": 3}], "remote": false, "multilocation": [{"city": "Poznań", "street": "Rubież 46", "slug": "apollogic-sap-basis-administrator"}], "description": "Apollogic to firma z 15 letnim doświadczeniem w wyspecjalizowanym doradztwie IT. Oferujemy usługi z zakresu systemów SAP, Business Intelligence oraz tworzenie i rozwijanie aplikacji biznesowych. Oferujemy również wdrażanie innowacyjnych rozwiązań z obszaru IoT, Machine Learning i Sztucznej Inteligencji.\n Twoją rolą w tym składzie będzie instalowanie, zarządzanie, monitorowanie oraz rozwiązywanie problemów w systemach SAP w organizacji.\nBędziesz pracować nad automatyzacją zadań, migracją do S/4HANA oraz usprawnieniem aktualnego środowiska SAP.\nDodatkowo będziesz zajmował się bazami danych HANA, MaxDB i Sybase.\n\nTa praca jest dla Ciebie, jeśli\n\nPosiadasz 2 letnie doświadczenie w pracy z systemami SAP na stanowisku SAP Basis\nZnasz SAP BTP lub inne usługi chmurowe SAP\nMasz doświadczenie w pracy z systemami Linux (mile widziana dystrybucja SuSE)\nZnasz język SQL i bazy danych na poziomie podstawowym\nZnasz język angielski na poziomie umożliwiającym posługiwanie się dokumentacją techniczną\nPosiadasz zdolność analitycznego myślenia i logicznego rozwiązywania problemów\n\nMile widziane\n\nZnajomość podstaw ABAP \n\nNasza oferta i benefity\n\nWynagrodzenie adekwatne do Twoich umiejętności\nDowolna forma współpracy\nKursy językowe (angielski i niemiecki) w godzinach pracy\nSzkolenia IT - zależy nam na Twoim rozwoju\nCodzienny kontakt z zespołem specjalistów w swojej dziedzinie\nWsparcie i opiekę naszych mentorów\nWsparcie psychologiczne specjalistów z MOCodajni\nElastyczne godziny pracy oraz całkowitą pracę zdalną\nMożliwość otrzymania budżetu na realizację własnych pomysłów i udziału w zyskach ze sprzedaży\nMożliwość podejmowania inicjatyw wpływających na kierunek rozwoju zespołu\nNarzędzia niezbędne do pracy\nKartę Multisport, ubezpieczenie na życie, prywatną opiekę medyczną na preferencyjnych warunkach\nNiekorporacyjną atmosferę\nBiuro położone na terenie Poznańskiego Parku Naukowo-Technologicznego\nWspólne śniadania w piątki oraz świeże owoce w biurze\n Cały proces rekrutacyjny jest w pełni zdalny i zawiera jedynie 2 części:  \n\nPo wstępnej weryfikacji aplikacji rekruterka skontaktuje się telefonicznie z wybranymi kandydatami na kilkuminutową rozmowę\nW drugim kroku weryfikacji spotykamy się na Teamsach z Tobą oraz dwiema osobami z danego zespołu, w tym z Team Leaderem, dzięki czemu otrzymasz kompletne informacje na temat stanowiska\n\nKażdy kandydat na pewno zostanie poinformowany o etapie, na którym się znajduje.\nInformujemy, że administratorem danych jest Apollogic z siedzibą w Poznaniu, ul. Rubież 46 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadz... more"}, {"title": "Architekt bezpieczeństwa IT Pilzno", "street": "Ludwika Chmury 3", "country_code": "PL", "address_text": "Ludwika Chmury 3, Rzeszów", "marker_icon": "security", "workplace_type": "partly_remote", "company_name": "Omega Pilzno", "company_url": "http://www.omega-pilzno.com.pl", "company_size": "501+", "experience_level": "mid", "id": "omega-pilzno-architekt-bezpieczenstwa-it-pilzno", "employment_types": [{"type": "permanent", "salary": null}], "skills": [{"name": "Windows", "level": 3}, {"name": "Linux", "level": 3}, {"name": "Cybersecurity", "level": 4}], "remote": false, "multilocation": [{"city": "Rzeszów", "street": "Ludwika Chmury 3", "slug": "omega-pilzno-architekt-bezpieczenstwa-it-pilzno"}], "description": "OMEGA Pilzno, to jeden z największych operatorów logistycznych w Polsce. Stale się rozwijamy i powiększamy nasz zespół. Wyróżnia nas to, że: pracujemy z pasją, dbamy o rozwój, wspólnie osiągamy cele, gwarantujemy stabilną pracę i transparentne warunki zatrudnienia, nie ma u nas korporacyjnych ograniczeń.\n\nDołącz do nas i obierz trasę do kariery!\n\nArchitekt bezpieczeństwa IT Pilzno\n\n\nOpis stanowiska\nTworzenie i rozwój architektury bezpieczeństwa IT\nPrace rozwojowe w zakresie opracowania koncepcji rozwiązania oraz specyfikacji wymagań funkcjonalnych i technicznych\nBadania empiryczne w zakresie możliwości zastosowania narzędzi w zakresie bezpieczeństwa systemowego, w tym analiza i korelacja zdarzeń, pochodzących z wielu źródeł\nWsparcie biznesu w kształtowaniu wymagań bezpieczeństwa na potrzeby nowo wdrażanych rozwiązań\nOpracowywanie dokumentacji architektonicznej w zakresie bezpieczeństwa, w tym specyfikacji funkcjonalnej i niefunkcjonalnej oraz projektu technicznego\nWspółpraca z integratorami rozwiązań bezpieczeństwa w ramach prac projektowych\nUdział w opracowaniu założeń testów oraz scenariuszy testowych, analizowanie wyników testów na kolejnych poziomach gotowości technologicznej rozwiązań cyberbezpieczeństwa\nUstalanie ram i podejścia do realizacji dalszych prac rozwojowych\n \n\nNasze wymagania\nWykształcenie wyższe o kierunku informatycznym lub technicznym\nMinimum 3 letnie doświadczenie w projektowaniu lub utrzymaniu architektury cyberbezpieczeństwa w środowiskach złożonych z systemów Linux, Windows\nWiedza z zakresu bezpieczeństwa IT w jednej z dziedzin: systemy operacyjne Windows / Linux, sieci, bazy danych, certyfikaty bezpieczeństwa z tego zakresu będą dodatkowym atutem\nWiedza na temat najważniejszych rodzajów cyberzagrożeń, w tym wektorów ataków i technik stosowanych przez cyberprzestępców oraz metod obrony przed nimi\nZnajomość języka angielskiego, pozwalająca na swobodną komunikację (przygotowanie opracowań, czy czytanie dokumentacji technicznej)\n \n\nMile widziane\nDoświadczenie we wdrażaniu narzędzi systemów z obszaru bezpieczeństwa IT\nDoświadczenie w projektowaniu aplikacji narzędzi do zarządzania ryzykiem i cyberbezpieczeństwem\nPosiadanie certyfikatów branżowych z obszaru systemów operacyjnych, sieci, bezpieczeństwa\nZnajomość zagadnień Cloud Security\nZnajomość zagadnień DevSecOps\n \n\nOferujemy\npracę w jednej z największych firm transportowych z 30-letnią tradycją\nstabilność zatrudnienia (umowa o prace + system premiowania)\nprzygotowany specjalnie dla Ciebie program wdrożeniowy, który pomoże Ci odnaleźć się na nowym stanowisku\nna każdym etapie rozwoju wsparcie merytoryczne i udział w szkoleniach podnoszących kompetencje\nmożliwość wszechstronnego rozwoju w wybranym dla Ciebie kierunku\ndofinansowanie zajęć sportowych\nprywatną opiekę medyczną\nubezpieczenie na życie\nspotkania integracyjne\nbrak dress code’u\nparking dla pracowników\nprogram rekomendacji pracowników\ndobrą kawę :)\n\n\nJeśli Twoje CV wpisze się w nasze oczekiwania, spodziewaj się:\nTelefonu od działu IT.\nVideocall z Michałem Głodem Kierownikiem Działu IT, aby wzajemnie lepiej się poznać.\nJeśli pozytywnie przejdziesz rozmowę, czeka Cię spotkanie m.in. z menedżerem HR, i  Kierownikiem Działu IT.\nNo i na koniec, spodziewać się możesz oferty, bądź telefonicznego feedbacku z podziękowaniem za udział w procesie rekrutacji.\n \nJeśli Twoje oczekiwania identyfikują się z naszymi i chcesz dołączyć do naszej ekipy - ślij swoje #CV już teraz!  🤩\nInformujemy, że administratorem danych jest Omega Pilzno z siedzibą w Rzeszowie, ul.Ludwika Chmury 3(dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do or... more"}, {"title": "Młodszy spec ds. wsparcia IT", "street": "Bonifraterska 17", "country_code": "PL", "address_text": "Bonifraterska 17, Warszawa", "marker_icon": "support", "workplace_type": "partly_remote", "company_name": "Emerge IT Support", "company_url": "https://emergeitsupport.pl/", "company_size": "25", "experience_level": "junior", "id": "emerge-it-mlodszy-specjalista-ds-wsparcia-it", "employment_types": [{"type": "b2b", "salary": null}, {"type": "permanent", "salary": null}], "skills": [{"name": "Bazy Danych", "level": 1}, {"name": "SQL", "level": 1}], "remote": false, "multilocation": [{"city": "Warszawa", "street": "Bonifraterska 17", "slug": "emerge-it-mlodszy-specjalista-ds-wsparcia-it"}], "description": "W Emerge IT Support realizujemy kompleksowe usługi IT dla biznesu.\n\n\nW codziennej pracy łączymy nasze doświadczenie w branży z indywidualnym podejściem do każdego Klienta, oferując profesjonalne rozwiązania informatyczne w ramach outsourcingu usług IT – począwszy od service desku, poprzez zarządzanie infrastrukturą sieciową, aż do wdrożenia aplikacji biznesowej.\n\n\nJeżeli chcesz rozwijać swoje umiejętności w obszarze wsparcia IT/service desk...\n\n\nDodatkowo zależy Ci na pracy w zgranym zespole, w którym panuje przyjazna atmosfera.\n\n\nCo więcej, nie boisz się nowych wyzwań i lubisz pomagać innym!\n\n\nTo znaczy, że czekamy właśnie na Ciebie!\n\n\nMłodszy specjalista ds. wsparcia IT\nMiejsce pracy: Warszawa\n\nTwoje zadania:\nWsparcie IT w zakresie obsługi sprzętu oraz oprogramowania;\nAnaliza i rozwiązywanie zgłaszanych problemów dotyczących sprzętu komputerowego, oprogramowania i sieci;\nDiagnozowanie problemów i kategoryzacja według stopnia ważności;\nInstalacja infrastruktury sieciowej oraz oprogramowania;\nNaprawa awarii hardware i software oraz nadzór nad prawidłowym funkcjonowaniem sprzętu oraz jego instalacja i konfiguracja;\nInstalacja i upgrade oprogramowania na desktopach i laptopach;\nMonitorowanie bezpieczeństwa stacji roboczych;\nTworzenie i utrzymanie dokumentacji technicznej systemów informatycznych;\nZarządzanie uprawnieniami, ewidencja sprzętu.\n\nJesteś idealnym kandydatem? Sprawdź czy:\nPosiadasz umiejętność instalacji, konfiguracji oraz administrowania systemami operacyjnymi (Windows, Linux, OS X);\nMożesz wykazać się znajomością zagadnień dot. budowy oraz konfiguracji sieci komputerowych LAN/WAN/WLAN;\nPosiadasz umiejętność konfiguracji oraz administracji urządzeniami sieciowymi (modemy, routery, switche itp.);\nPosiadasz znajomość serwerowych systemów operacyjnych, zagadnień AD, MS Exchange, Office 365;\nMasz doświadczenie w administracji bazami danych SQL (MsSQL, MySQL, Firebird, Pervasive);\nZajmowałeś/aś się administracją systemami antywirusowymi, zarządzaniem systemami backup’owymi, administracją systemami wirtualizacji;\nZnasz język angielski na poziomie umożliwiającym czytanie dokumentacji technicznej\nSzybko się uczysz i chętnie podejmujesz nowe zadania;\nLubisz pracę z ludźmi w dynamicznym środowisku pracy;\nCechuje Cię odpowiedzialność i duże zaangażowanie w prowadzone projekty.\n\nDodatkowym atutem będą:\nUkończone studia wyższe o profilu informatycznym lub pokrewnym;\nZnajomość baz danych oraz języka SQL;\nPrawo jazdy kat. B;\nDoświadczenie w pracy na rzecz różnorodnych Klientów będzie dodatkowym atutem.\nWiedza z zakresu ITIL oraz umiejętność pracy na systemach rejestracji zgłoszeń;\nZnajomość języka angielskiego na poziomie B2\n\nCo oferujemy?\nPrywatną opiekę medyczną;\nDofinansowanie karty Benefit Multisport;\nMożliwość zdobycia doświadczenia w dynamicznie rozwijającej się firmie;\nPracę w zgranym zespole ekspertów w świetnej atmosferze;\nDużą samodzielność w działaniu;\nElastyczną formę współpracy (umowa o pracę lub umowa B2B).\n\nBrzmi interesująco? \nInformujemy, że administratorem danych jest Emerge IT Support z siedzibą w Warszawa (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesienia skargi do organu nadzorczego... more"}, {"title": "Intern IT (analiza biznesowo-systemowa)", "street": "Inflancka 4C", "country_code": "PL", "address_text": "Inflancka 4C, Warszawa", "marker_icon": "analytics", "workplace_type": "partly_remote", "company_name": "Philip Morris", "company_url": "http://www.pmicareers.pl", "company_size": "<1000", "experience_level": "junior", "id": "philip-morris-intern-it-analiza-binesowo-systemowa", "employment_types": [{"type": "mandate_contract", "salary": null}], "skills": [{"name": "Agile", "level": 1}, {"name": "Bazy Danych", "level": 1}, {"name": "Salesforce", "level": 1}], "remote": false, "multilocation": [{"city": "Warszawa", "street": "Inflancka 4C", "slug": "philip-morris-intern-it-analiza-binesowo-systemowa"}], "description": "TWÓRZ Z NAMI HISTORIĘ! \n\nW PMI zdecydowaliśmy się zrobić coś niesamowitego. Całkowicie zmieniamy naszą działalność i budujemy naszą przyszłość na jednym jasnym celu – budowanie przyszłości bez dymu tytoniowego. \n\nOgromna zmiana wiąże się z ogromną szansą. Tak więc, gdziekolwiek do nas dołączysz, będziesz cieszyć się swobodą marzeń i dostarczaniem lepszych, jaśniejszych rozwiązań oraz przestrzenią, aby rozwijać swoją karierę w nieskończenie różnych kierunkach.\n\nDOŁĄCZ DO NAS!\n\nKOGO SZUKAMY?\nJesteś Studentem/ką ostatnich lat studiów (4. i 5. rok) lub asbolwentką/em (studia licencjackie/inżynierskie/magisterskie do 12 miesięcy po obronie)\nSwobodnie komunikjesz sie w języku polskim (współpraca z polskojęczycznymi osobami) i angielskim (min.B2)\nMasz już doświadczenie w prowadzeniu projektów (znasz Agilowe podejście) lub chcesz się rozwijać w tym obszarze\nPracowałeś/aś z rozwiązaniami Salesforce (mile widziane)\nWyróżniasz się  skrupulatnością oraz otwartością na współpracę z innymi i umiejętnościami pozwalającymi pracować nad złożonymi problemami biznesowymi oraz technologicznymi\nJesteś dostępna/y ok. 30 h tygodniowo\n\n\nCO CI OFERUJEMY?\nMożliwość rozwoju w międzynarodowej firmie, pracę na rozbudowanych i nowoczesnych systemach\n6-miesięczną umowę zlecenie z atrakcyjną stawką godzinową (możliwość przedłużenia współpracy)\nElastyczny czas pracy i możliwość pracy hybrydowej - z łatwością pogodzisz staż ze studiami \nWspólną pracę nad Twoimi zdolnościami digitalowo-technologicznymi poprzez współpracę z wieloma różnorodnymi zespołami projektowymi\nSzkolenia wprowadzające i rozwijające, \nDostęp do naszych wewnętrznych platform szkoleniowych, w tym do platformy do nauki języków obcych,\nŚwietną lokalizację – blisko metra Dworzec Gdański\n \nCZYM BEDZIESZ SIĘ ZAJMOWAĆ?\nUdziałem w projektach tworzenia ekosystemu IT dla działów sprzedaży, marektingu, digitalu, e-commerce\nAnalizą i przygotowywaniem dokumentacji projektowej\nWsparciem testów systemowych (UAT)\nWsparciem zadań związanych z cybersecurity\nRozwijaniem swoich umiejętności tłumaczenia wymagań biznesowych na wytyczne technologiczne\nPracą nad indywidualnymi projektami\n\nNależy pamiętać, że brane będą pod uwagę wyłącznie zgłoszenia on-line. \nSkontaktujemy się tylko z wybranymi kandydatami.\nInformujemy, że administratorem danych jest Philip Morris Polska Distribution Sp.z o.o. siedzibą w Krakowie, ul. jana Pawła II 196 (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia da... more"}, {"title": ".NET / Angular Developer", "street": "Gajowa 6", "country_code": "PL", "address_text": "Gajowa 6, Poznań", "marker_icon": "net", "workplace_type": "partly_remote", "company_name": "FORCOM Sp. z o.o.", "company_url": "http://www.forcom.com.pl", "company_size": "500+", "experience_level": "mid", "id": "forcom-sp-z-o-o-net-angular-developer-72129eec-0200-46b8-a634-8ac6546056fc", "employment_types": [{"type": "b2b", "salary": {"from": 14000, "to": 17000, "currency": "pln"}}], "skills": [{"name": "Angular", "level": 4}, {"name": ".Net", "level": 4}, {"name": "C#", "level": 4}], "remote": false, "multilocation": [{"city": "Bydgoszcz", "slug": "forcom-sp-z-o-o-net-angular-developer-bydgoszcz", "street": "Centrum"}, {"city": "Łódź", "slug": "forcom-sp-z-o-o-net-angular-developer-lodz", "street": "Centrum"}, {"city": "Poznań", "slug": "forcom-sp-z-o-o-net-angular-developer-72129eec-0200-46b8-a634-8ac6546056fc", "street": "Gajowa 6"}, {"city": "Toruń", "slug": "forcom-sp-z-o-o-net-angular-developer-torun", "street": "Centrum"}], "description": "O firmie: \n\nzatrudniamy ponad 500 pracowników, \ntworzymy aplikacje składające się na kompletny ekosystem rozwiązań dla największych retailerów w Polsce i za granicą; rozwiązania te integrują działanie w kanale offline z e-commerce, self-scanningiem, interakcją z klientem w aplikacji mobilnej; obejmują również spersonalizowane systemy lojalnościowe, obsługę płatności elektronicznych, w tym również w aplikacji mobilnej, systemy oparte o AI.\n\nKogo szukamy: \n\nprogramistów .NET / Angular  \nosoby z minimum 5-letnim doświadczeniem w programowaniu w C#, ale jeśli masz mniejsze lub dużo większe doświadczenie od wymaganego, to też aplikuj – poszukujemy kandydatów również na inne stanowiska.\n\nForma zatrudnienia:\n\nB2B lub umowa o pracę\n\nStos technologiczny projektu:\n\nC#, Typescript, Angular 11+, Docker, Kubernetes, Dependency Injection, Material Design, Big Data, Microservices, \nGitLab, REST Api, Unit Tests, RxJs\n\nOpis stanowiska: \n\nprojektowanie oraz implementacja aplikacji o architekturze mikrousługowej (80% czasu), \nwykonywanie code review, \ntworzenie i aktualizacja dokumentacji, \nwsparcie zespołu i QA swoją wiedzą. \n\nLiczba osób w zespole\n\n6-8\n\nSkład zespołu\n\nbackend developer\nfullstack developer\narchitekt\ndevOps\nprogramista testów automatycznych\ntester manualny\nproduct owner\nscrum master\n\nTak pracujemy\n\nwewnątrz organizacji\nkoncentrujesz się na jednym projekcie\nmożesz zmienić projekt\nmasz wpływ na rozwiązania technologiczne\nmasz wpływ na produkt\ntworzysz kod \"od zera\"\nkoncentrujesz się na rozwoju produktu\nagile\nscrum\nkanban\n\nZapewniamy: \n\nmożliwość wyboru formy zatrudnienia: UoP lub B2B, \npracę w małych zespołach w metodologii Scrum/Scrumban, \nmożliwość wyboru trybu pracy: zdalna, hybrydowa lub stacjonarna\nw Poznaniu - biurowiec w samym centrum (okolice ronda Kaponiera), \nbrak korporacyjnych zasad, \nelastyczne godziny pracy, \nGoogle Workspace - G Suite,\nprywatną opiekę medyczną, \nbrak dress code-u, \ninteresujące projekty z różnych dziedzin, \nbudżet na konferencje, szkolenia i literaturę, \ndarmowe obiady - codziennie do wyboru kilkanaście różnych dań, \ndarmowe lekcje j. angielskiego, \ngrupy sportowe, \nzespoły muzyczne. \n\nMile widziane: \n\nznajomość Material Design, Scrum/Scrumban, Big Data, SQL, Microservices, REST Api, Unit Tests, Rxjs,\nznajomość Kubernetes, Docker, GitLab.\nInformujemy, iż administratorem Pani/Pana danych osobowych jest Forcom Sp. z o.o. z siedzibą w Poznaniu, ul. Gajowa 6, kod 60-815, nr KRS 0000012959, NIP: 7811692277. Informujemy, że dobrowolnie podane przez Panią/Pana dane osobowe będą przetwarzane w celu przeprowadzenia procesu rekrutacji na oferowane stanowisko. Informujemy również, że przysługuje Pani/Panu p... more"}, {"title": "Automation Test Engineer", "street": "Zabłocie 43A", "country_code": "PL", "address_text": "Zabłocie 43A, Kraków", "marker_icon": "net", "workplace_type": "remote", "company_name": "j-labs", "company_url": "http://www.j-labs.pl", "company_size": "+500", "experience_level": "senior", "id": "j-labs-automation-test-engineer", "employment_types": [{"type": "b2b", "salary": {"from": 20160, "to": 24360, "currency": "pln"}}, {"type": "permanent", "salary": {"from": 15000, "to": 18500, "currency": "pln"}}], "skills": [{"name": "SpecFlow", "level": 3}, {"name": "Selenium/Playwright", "level": 3}, {"name": "C#", "level": 4}], "remote": true, "multilocation": [{"city": "Kraków", "street": "Zabłocie 43A", "slug": "j-labs-automation-test-engineer"}], "description": "Stworzysz od zera framework testowy oraz będziesz odpowiadać za automatyzację testów UI oraz integracyjnych i przeprowadzanie testów performance.\n\nProjekt: \n\nGreenfield - POC było tworzone ok. pół roku temu.\nAplikacja zbiera dane z różnych źródeł i umożliwia monitorowanie, analizę pracy urządzeń w fabrykach oraz podejmowanie odpowiednich działań (np. mających na celu uniknięcie awarii).\nDocelowo aplikacja będzie rozwijana o kolejne funkcjonalności. W przyszłości planowane jest również stworzenie aplikacji mobilnej.\nNad projektem pracuje zespół złożony z 3 developerów (1 frontend, 2 backend) oraz architekta. Codzienna komunikacja odbywa się po angielsku.\nMożliwe podróże służbowe do Niemiec (1-2 razy w roku).\nMożliwość pracy 100% zdalnie.\n\nStack technologiczny w projekcie:\n\n.NET7\nReact 18\nC++20\nPython\nAzure\nAzure DevOps\nGithub\n\nWymagania:\n\nMinimum 4 lata doświadczenia w automatyzacji testów.\nZnajomość C#, Selenium/Playwright, Specflow, XUnit/NUnit.\nDoświadczenie w testach wydajnościowych.\nDoświadczenie w tworzeniu od zera frameworków testowych.\nZrozumienie założeń SOLID.\nZnajomość Docker (lub podobnych technologii konteneryzacji) oraz Git.\nZnajomość języka angielskiego na poziomie min. B2.\nMile widziane: doświadczenie z Python i Machine Learning.\n\nDlaczego j-labs?\n\nj-labs to firma stworzona przez inżynierów dla inżynierów. W codziennej pracy ważna jest dla nas wysoka jakość – Robimy dobre IT albo wcale!\nZależy nam na długoterminowej współpracy, nie tylko w ramach jednego projektu. W j-labs możesz zmieniać projekty (tak po prostu!), poznawać różne branże i nowe technologie.\nMasz możliwość rozwoju własnej marki - udział w Talk4Devs jako prelegent/ka lub autor/ka artykułów naszego tech bloga.\nLubimy dzielić się wiedzą w ramach naszych Gildii technologicznych czy Meet up`ów. \nStawiamy na jakość i przyciągamy specjalistów; średnie doświadczenie naszych inżynierów to ponad 8 lat.\nj-People First! Budujemy relacje w oparciu o zaufanie i rzetelność. Traktujemy innych tak jak sami chcielibyśmy być traktowani!\nAdministratorem danych osobowych jest J-Labs Sp. z o. o. (J-LABS), ul. Zabłocie 43a, 30-701 Kraków. We wszystkich sprawach dotyczących przetwarzania danych osobowych oraz korzystania z praw związanych z ich przetwarzaniem, można skontaktować się pisemnie na adres siedziby J-LABS lub poprzez adres e-mail: gdpr@j-labs.pl. Podane w formularzu dane osobowe przetwa... more"}, {"title": "Azure DevOps Engineer", "street": "Aleje Jerozolimskie 180a", "country_code": "PL", "address_text": "Aleje Jerozolimskie 180a, Warszawa", "marker_icon": "devops", "workplace_type": "remote", "company_name": "Goelett", "company_url": "http://www.goelett.com", "company_size": "+140", "experience_level": "senior", "id": "goelett-azure-devops-engineer", "employment_types": [{"type": "b2b", "salary": {"from": 20000, "to": 25000, "currency": "pln"}}, {"type": "permanent", "salary": {"from": 17000, "to": 21000, "currency": "pln"}}], "skills": [{"name": "Azure PaaS", "level": 4}, {"name": "DevOps", "level": 4}, {"name": "Azure", "level": 4}], "remote": true, "multilocation": [{"city": "Warszawa", "slug": "goelett-azure-devops-engineer", "street": "Aleje Jerozolimskie 180a"}, {"city": "Białystok", "slug": "goelett-azure-devops-engineer-bialystok", "street": "Handlowa 6G"}], "description": "We are an extraordinary mix of travel industry experts, product, and software engineers, developing a successful online booking tool for corporations and large organizations. Today, as a part of the sector leader CDS Groupe, we support 500k+ business users making thousands of bookings a day.\n We are looking for an experienced Azure DevOps Engineer to be a part of our DevOps team. The successful candidate will be responsible for designing and implementing continuous integration and delivery pipelines for our software projects, as well as maintaining and troubleshooting our Azure-hybrid based infrastructure. (70% Azure 30% on premise)\n\nAs the Azure DevOps Engineer/on premise Administrator, you will be focusing on:\n\nDesigning and implement CI/CD pipelines using Azure DevOps\nAutomate the deployment of applications and infrastructure to Azure\nMonitor and maintain Azure based on premise and based on infrastructure\nTroubleshoot and resolve issues with infrastructure and applications\nCollaborate with development teams to ensure smooth and efficient delivery of software\nStay up-to-date with the latest advancements in Azure DevOps and related technologies\n\nDesirable experience and skills:\n  Strong communication and collaboration skills\nStrong problem-solving and troubleshooting skills\nExperience with Azure networking\nExperience with Azure PAAS services: App service, Function apps, Service bus\nExperience with Azure Monitoring, Application Insights\nExperience with Azure DevOps, YAML pipelines, ARM templates\nExperience with monitoring tools like Zabbix, Grafana or similar\nFamiliar with Windows: pathing, monitoring, configuring, IIS and Windows services\nFamiliar with Linux: pathing, monitoring, configuring, services management\nScripting: PowerShell\n\nWhat you will have:\n\nOpportunity to build the top user-centric product in travel business\nCareer sprints driving your development inside Goelett\nThe hybrid way of working, remote work is nothing new for us. If you want to come to the office, you will find company there as well.\nAutonomy with all our support\nMedical care\nMulti-sport card\nBirthday holiday (extra day off to celebrate with family and friends)\nVolunteering day off - you will be able to make a mark and join our initiatives to support local communities, animals and planet\nLanguage courses\nAccess to a health-and-wellbeing platform (Mindgram)\nTeam integrations and fun events\nInformujemy, że administratorem danych jest Goelett Sp. z o.o. z siedzibą w Warszawie, ul. Aleje Jerozolimskie 180, (dalej jako \"administrator\"). Masz prawo do żądania dostępu do swoich danych osobowych, ich sprostowania, usunięcia lub ograniczenia przetwarzania, prawo do wniesienia sprzeciwu wobec przetwarzania, a także prawo do przenoszenia danych oraz wniesie... more"}]