[{"title": "iOS Developer", "street": "Plac Teatralny 8", "country_code": "PL", "address_text": "Plac Teatralny 8, Wrocław", "marker_icon": "mobile", "workplace_type": "partly_remote", "company_name": "Opera Software", "company_url": "https://www.opera.com", "company_size": "200+", "experience_level": "mid", "id": "opera-software-ios-developer-6a381bc1-3d8e-4ebf-9ef8-1c5fb0f07acd", "employment_types": [{"type": "permanent", "salary": {"from": 14000, "to": 23000, "currency": "pln"}}], "skills": [{"name": "iOS", "level": 4}, {"name": "UIKit", "level": 4}, {"name": "Swift", "level": 4}], "remote": false, "multilocation": [{"city": "Wrocław", "street": "Plac Teatralny 8", "slug": "opera-software-ios-developer-6a381bc1-3d8e-4ebf-9ef8-1c5fb0f07acd"}], "description": "The Opera GX team is looking for a Software Developer who has the curiosity and drive to join our mobile team.\n\nYou will be working with Swift on iOS, but we believe that a good developer can learn and master any new field. \nWe have humble and skilled team members eager to share their knowledge and help you in any situation.\n\nOur organisation is flat and we work with iterative processes between a tight-knit group of product managers, designers, developers and quality assurance engineers.\n\nRole & Responsibilities:\n\nCreate and maintain features for Opera GX mobile product \nDeliver functionality that fulfils high-level requirements\nAdapt to and learn new technologies\nParticipate and contribute in all parts of the Opera GX development lifecycle\n\nJob Requirements:\n\nExcellent Swift skills\nExperience with UIKit\nFamiliarity with Core Data\nVery good knowledge of the iOS platform\nAbility to write well-structured and maintainable code\nFluency in English, both written and spoken\nGood communication skills and ability to work in a team environment\nDrive and commitment to work in a highly dynamic environment\n\nDiversity and Inclusion \nAt Opera diversity and inclusion are central to our values. We recognise that being diverse and inclusive makes us stronger as a business. Our aim is to attract, recruit and retain people who reflect the diverse nature of our business, clients and communities regardless of nationality, ethnicity, faith, belief, sexual orientation, gender identity, social background, age and disability.\n\nWhat’s on Offer:\n\nWork on the equipment of your choice to the highest specification\nSelf-development opportunities\nHealthcare package and life insurance\nMultisport card and co-financing for health and fitness services\nEmployee referral program\nAskHenry concierge service, English lessons, massages at the office\nParking close to the office\nQuarterly integration events\nDaily breakfast in the office kitchen\nPlayroom with billiards and ping-pong tables, consoles, fussball, etc.\n\nInterested?\nWe will review applications continuously, so apply now! We are looking forward to hearing from you.\n About Us: \nOpera is a global web innovator with an engaged and growing base of hundreds of millions of monthly active users who seek a better internet experience. Building on over 25 years of innovation that started with browser products, Opera is now leveraging its brand and highly engaged user base in order to expand its business into new segments. Today, Opera offers users around the world a range of products and services that include PC and mobile browsers, the newsreader Opera News, and apps committed to gaming, e-commerce and classifieds.\n\n\nOpera is headquartered in Oslo, Norway with major offices in Poland, China, Spain and Sweden, as well as a presence in many additional countries. Opera is listed on the Nasdaq stock exchange under the “OPRA” ticker symbol."}]